[{"title":"AnyChart JS","url":"/library/anychart-js","id":"anychart-js","library":{"id":"anychart-js","description":"AnyChart is a flexible, cross-platform and cross-browser JavaScript charting library that allows you to create interactive HTML5 charts, stock charts, maps, Gantt charts, and dashboards for any project, in any browser, and on any platform/OS.\n\nAnyChart provides advanced customization and flexibility opportunities, no matter if you are developing a website, a BI app for corporate use, or software for your clients. The library's JavaScript API allows you to create even big data based charts in real time, with continuous updates and multi-level drill-downs. You can use any server platform or database, and you will get amazing informative visualization on all devices - Macs, laptops, PCs, smartphones, and tablets.\n\nAnyChart has four main JavaScript/HTML5 charting solutions.\n\nAnyChart JS Charts and Dashboards provides scatter, line, bar, area, waterfall, spline, funnel, bubble, polar, column, columnrange, pie, box plot, angular gauge, areasplinerange, and many other types of charts available separately and in combination, with single or multiple axes.\n\nAnyStock Financial and Stock JS Charts converts any real-time data into sophisticated charts that can easily be made interactive. Scrolling, drill downs, zoom, and panning make Reports and Dashboards greatly visualized to facilitate reviewing long-term and big data sets while analyzing Forex, commodity, investment and other market data.\n\nAnyMap JS Maps is perfect for dashboards and side-by-side reporting. This HTML5 mapping solution helps you build interactive maps for any browser on any platform. Use it to display sales by region, election results, population density and other geo-related data.\n\nAnyGantt JS Gantt Charts allows you to utilize power of animation and ultimate interactivity to build complex and informative HTML5 Gantt charts, which can be used with ASP.NET, ASP, PHP, JSP, ColdFusion, Ruby on Rails or simple HTML pages to visualize data from any warehouse: text, Excel, CSV - MySQL, MS SQL, Oracle DB servers.","logo":"http://img.stackshare.io/service/3319/DzHriaGc.png","name":"AnyChart JS","links":{"site":"http://www.anychart.com"},"tags":["chart","charting","charts","commercial","gantt","graph","html5","javascript","visualization"]}},{"title":"morris.js","url":"/library/morris-js","id":"morris-js","library":{"id":"morris-js","description":"Making good-looking graphs shouldn't be hard. Morris.js is a lightweight library that uses jQuery and Raphaël to make drawing simple charts easy.","logo":"https://avatars.githubusercontent.com/u/6538127?v=2","name":"morris.js","links":{"site":"https://morrisjs.github.io/morris.js/","github":"https://github.com/morrisjs/morris.js"},"tags":["Raphaël","chart","charting","graph","graphing","svg"]}},{"title":"AnyMap JS","url":"/library/anymap-js","id":"anymap-js","library":{"id":"anymap-js","description":"AnyMap JavaScript mapping library helps you build interactive maps that look great in any browser on any platform.\n\nAnyMap is perfect for interactive dashboards and side-by-side reporting. You can use it to display sales by region, election results, population density or any other geo-related data.\n\nAnyMap JS maps are absolutely compatible with basic charts, stock charts and Gantt charts also offered by AnyChart http://www.anychart.com, and can be used as part of the dashboard as good as standalone map visualization solution.\n\nAnyMap comes with ready-to-use Maps Collection which you can use at no additional cost. Custom maps can be created from any SHP map.","logo":"https://drive.google.com/a/anychart.com/file/d/0B2Ym3TNPFjTpOFpoVWVGblNQWlU/view?usp=sharing","name":"AnyMap JS","links":{"site":"http://www.anychart.com/products/anymap"},"tags":["chart","charting","charts","commercial","gantt","graph","html5","javascript","visualization"]}}]