[{"title":"dc.js","url":"/library/dc-js","id":"dc-js","library":{"id":"dc-js","description":"dc.js is a javascript charting library with native crossfilter support and allowing highly efficient exploration on large multi-dimensional dataset (inspired by crossfilter's demo). It leverages d3 engine to render charts in css friendly svg format. Charts rendered using dc.js are naturally data driven and reactive therefore providing instant feedback on user's interaction. The main objective of this project is to provide an easy yet powerful javascript library which can be utilized to perform data visualization and analysis in browser as well as on mobile device.","logo":"https://avatars2.githubusercontent.com/u/6378965?v=3","name":"dc.js","links":{"github":"https://github.com/NickQiZhu/dc.js"},"tags":["charts","d3.js"]}},{"title":"DHTMLX","url":"/library/dhtmlx","id":"dhtmlx","library":{"id":"dhtmlx","description":"DHTMLX is a JavaScript component library that enables developers to build cross-browser, feature-rich web apps fast. The DHTMLX UI widgets cover the most commonly required functionality of enterprise web apps:\n\n\npowerful grid\nautocomplete\nnavigation controls\nwindows\ncalendar\ncharts\nsimple layout system, etc.\n\n\nThe library comes with ready-to-use server-side data connectors for PHP, ASP.NET, Java, and Cold Fusion.","logo":"http://dhtmlx.com/codebase/images/first36/v36_screens.png","name":"DHTMLX","links":{"site":"http://dhtmlx.com/"},"tags":["autocomplete","charts","framework","grid","html5","javascript","ui"]}},{"title":"jQuery.Gantt","url":"/library/jquery-gantt","id":"jquery-gantt","library":{"id":"jquery-gantt","description":"jQuery Gantt Chart is a simple chart that implements gantt functionality as a jQuery component.","logo":"/images/repo.png","name":"jQuery.Gantt","links":{"site":"https://taitems.github.com/jQuery.Gantt/","github":"https://github.com/taitems/jQuery.Gantt"},"tags":["charts","jquery"]}},{"title":"AnyChart JS","url":"/library/anychart-js","id":"anychart-js","library":{"id":"anychart-js","description":"AnyChart is a flexible, cross-platform and cross-browser JavaScript charting library that allows you to create interactive HTML5 charts, stock charts, maps, Gantt charts, and dashboards for any project, in any browser, and on any platform/OS.\n\nAnyChart provides advanced customization and flexibility opportunities, no matter if you are developing a website, a BI app for corporate use, or software for your clients. The library's JavaScript API allows you to create even big data based charts in real time, with continuous updates and multi-level drill-downs. You can use any server platform or database, and you will get amazing informative visualization on all devices - Macs, laptops, PCs, smartphones, and tablets.\n\nAnyChart has four main JavaScript/HTML5 charting solutions.\n\nAnyChart JS Charts and Dashboards provides scatter, line, bar, area, waterfall, spline, funnel, bubble, polar, column, columnrange, pie, box plot, angular gauge, areasplinerange, and many other types of charts available separately and in combination, with single or multiple axes.\n\nAnyStock Financial and Stock JS Charts converts any real-time data into sophisticated charts that can easily be made interactive. Scrolling, drill downs, zoom, and panning make Reports and Dashboards greatly visualized to facilitate reviewing long-term and big data sets while analyzing Forex, commodity, investment and other market data.\n\nAnyMap JS Maps is perfect for dashboards and side-by-side reporting. This HTML5 mapping solution helps you build interactive maps for any browser on any platform. Use it to display sales by region, election results, population density and other geo-related data.\n\nAnyGantt JS Gantt Charts allows you to utilize power of animation and ultimate interactivity to build complex and informative HTML5 Gantt charts, which can be used with ASP.NET, ASP, PHP, JSP, ColdFusion, Ruby on Rails or simple HTML pages to visualize data from any warehouse: text, Excel, CSV - MySQL, MS SQL, Oracle DB servers.","logo":"http://img.stackshare.io/service/3319/DzHriaGc.png","name":"AnyChart JS","links":{"site":"http://www.anychart.com"},"tags":["chart","charting","charts","commercial","gantt","graph","html5","javascript","visualization"]}},{"title":"JS Charts","url":"/library/js-charts","id":"js-charts","library":{"id":"js-charts","description":"JS Charts is a JavaScript based chart generator that requires little or no coding. With JS Charts drawing charts is a simple and easy task, since you only have to use client-side scripting (i.e. performed by your web browser). No additional plugins or server modules are required. Just include our scripts, prepare your chart data in XML, JSON or JavaScript Array and your chart is ready!","logo":"http://cdn.problogdesign.com/wp-content/uploads/2010/03/jscharts.jpg","name":"JS Charts","links":{"site":"http://www.jscharts.com/"},"tags":["charts","commercial"]}},{"title":"Koolchart","url":"/library/koolchart","id":"koolchart","library":{"id":"koolchart","description":"KoolChart offers 90+ types of charts, which have animation, 3D and gradient effects. Beyond the basic offerings, KoolChart provides advanced functions and chart types such as real-time monitoring chart, target vs actual chart, slide chart and candlestick chart in a single product package.","logo":"http://www.koolchart.com/images/html5_javascript_chart.png","name":"Koolchart","links":{"site":"http://www.koolchart.com","github":"https://github.com/Koolchart/Koolchart"},"tags":["bubble","chart","charts","data","free","graphs","html5","javascript","koolchart","library","line","visualization"]}},{"title":"TufteGraph","url":"/library/tuftegraph","id":"tuftegraph","library":{"id":"tuftegraph","description":"Make pretty graphs with javascript, using jQuery","logo":"/images/repo.png","name":"TufteGraph","links":{"site":"https://xaviershay.github.com/tufte-graph/","github":"https://github.com/xaviershay/tufte-graph"},"tags":["charts","jquery"]}},{"title":"dygraphs","url":"/library/dygraphs","id":"dygraphs","library":{"id":"dygraphs","description":"dygraphs is an open source JavaScript library that produces produces interactive, zoomable charts of time series. It is designed to display dense data sets and enable users to explore and interpret them.","logo":"/images/repo.png","name":"dygraphs","links":{"site":"http://dygraphs.com","github":"https://github.com/danvk/dygraphs"},"tags":["charts","graphs"]}},{"title":"OLAPCharts","url":"/library/olapcharts","id":"olapcharts","library":{"id":"olapcharts","description":"OLAPCharts is a programming free JavaScript Chart engine.\n\nIt contains all basic charts and a growing number of advanced charts and is fully interactive and responsive.\n\nBut the main focus lies on multidimensional data processing and transformation to make building dashboards easy.","logo":"http://www.olapcharts.com/logo.gif","name":"OLAPCharts","links":{"site":"http://www.olapcharts.com"},"tags":["OLAP","charts","commercial","graph","html5","javascript","library"]}},{"title":"Webix Organogram","url":"/library/webix-organogram","id":"webix-organogram","library":{"id":"webix-organogram","description":"Organogram is a JavaScript Webix widget intended for creating hierarchical diagrams that display links between posts and jobs in an organization or represent various parts of a complex structure. Due to the fact that the structure and API of Organogram are similar to Webix Tree ones, you will spend less time on learning this component. You can customize the appearance of this JavaScript widget according to the requirements of your project. It is possible to adjust the size of Organogram items, their content, arrangement and even more. What is more, to make the widget more informative you can add different HTML-objects to its items.It is possible to adjust the whole style of Organogram or its separate elements through CSS. You may also apply your own CSS rules to create a unique style of this widget.f you have an organization with branched structure and want to display it in a comprehensible format, you can present child elements of some items in a list form.Webix Organogram allows loading data in JSON or XML data formats. These data formats are easily customizable therefore you can use Organogram with your existing web-services. Since Organogram widget is based on the TreeStore, you can load data from a database on the server as well.","logo":"https://pbs.twimg.com/profile_images/378800000054262582/8ea5426795b3d478a4a94426f0ce4b4a_400x400.png","name":"Webix Organogram","links":{"site":"http://webix.com/widget/organogram/"},"tags":["charts","diagram","javascript","organogram"]}},{"title":"gRaphaël","url":"/library/graphael","id":"graphael","library":{"id":"graphael","description":"gRaphaël’s goal is to help you create stunning charts on your website. It is based on Raphaël graphics library. Check out the demos to see static and interactive charts in action.","logo":"http://www.newstrends.co.il/images/gRaphaelIcon.png","name":"gRaphaël","links":{"site":"http://g.raphaeljs.com/","github":"https://github.com/DmitryBaranovskiy/g.raphael"},"tags":["Raphaël","charts","sencha","svg"]}},{"title":"Zino UI","url":"/library/zino-ui","id":"zino-ui","library":{"id":"zino-ui","description":"Zino UI is a jQuery based, WAI-ARIA compatible, user interface framework consist of 25+ different components. Zino UI comes with HTML5 Canvas and SVG wrappers, Charts library and PHP server helpers.\n\nSome of widgets: datasource, datatable, treeview, selectbox, checkbox, combobox, radio group, button, spinner, progress bar, tabs, accordion, slider, slideshow, draggable, resizable, rating, calendar, tooltip, menu, ajax uploader.","logo":"https://zinoui.com/app/web/img/logo.png","name":"Zino UI","links":{"site":"https://zinoui.com"},"tags":["canvas","charts","components","jquery","svg","widgets"]}},{"title":"Harry Plotter","url":"/library/harry-plotter","id":"harry-plotter","library":{"id":"harry-plotter","description":"Lightweight standalone javascript library to plot charts, pies, river, etc in a canvas element.","logo":"/images/repo.png","name":"Harry Plotter","links":{"site":"https://nikopol.github.com/Harry-Plotter","github":"https://github.com/nikopol/Harry-Plotter"},"tags":["canvas","charts","plot"]}},{"title":"AnyMap JS","url":"/library/anymap-js","id":"anymap-js","library":{"id":"anymap-js","description":"AnyMap JavaScript mapping library helps you build interactive maps that look great in any browser on any platform.\n\nAnyMap is perfect for interactive dashboards and side-by-side reporting. You can use it to display sales by region, election results, population density or any other geo-related data.\n\nAnyMap JS maps are absolutely compatible with basic charts, stock charts and Gantt charts also offered by AnyChart http://www.anychart.com, and can be used as part of the dashboard as good as standalone map visualization solution.\n\nAnyMap comes with ready-to-use Maps Collection which you can use at no additional cost. Custom maps can be created from any SHP map.","logo":"https://drive.google.com/a/anychart.com/file/d/0B2Ym3TNPFjTpOFpoVWVGblNQWlU/view?usp=sharing","name":"AnyMap JS","links":{"site":"http://www.anychart.com/products/anymap"},"tags":["chart","charting","charts","commercial","gantt","graph","html5","javascript","visualization"]}},{"title":"jqPlot","url":"/library/jqplot","id":"jqplot","library":{"id":"jqplot","description":"jqPlot is a plotting and charting plugin for the jQuery Javascript framework. jqPlot produces beautiful line, bar and pie charts with many features:","logo":"/images/repo.png","name":"jqPlot","links":{"site":"http://www.jqplot.com/"},"tags":["charts","jquery"]}},{"title":"Highcharts JS","url":"/library/highcharts-js","id":"highcharts-js","library":{"id":"highcharts-js","description":"Highcharts is a charting library written in pure JavaScript, offering intuitive, interactive charts to your web site or web application. Highcharts currently supports line, spline, area, areaspline, column, bar, pie, scatter, angular gauges, arearange, areasplinerange, columnrange and polar chart types.","logo":"http://www.churchofrabbit.com/wp-content/posts/highcharts.png","name":"Highcharts JS","links":{"site":"https://www.highcharts.com/"},"tags":["chart","charts"]}},{"title":"Flotr2","url":"/library/flotr2","id":"flotr2","library":{"id":"flotr2","description":"Flotr2 is a library for drawing HTML5 charts and graphs. It is a branch of flotr which removes the Prototype dependency and includes many improvements.","logo":"https://0.gravatar.com/avatar/5363bc46c64c398e062f07befab68745?d=https://a248.e.akamai.net/assets.github.com%2Fimages%2Fgravatars%2Fgravatar-org-420.png","name":"Flotr2","links":{"site":"http://www.humblesoftware.com/flotr2/","github":"https://github.com/HumbleSoftware/Flotr2"},"tags":["charts","graphs","html5"]}},{"title":"JavaScript InfoVis Toolkit","url":"/library/javascript-infovis-toolkit","id":"javascript-infovis-toolkit","library":{"id":"javascript-infovis-toolkit","description":"The JavaScript InfoVis Toolkit provides tools for creating Interactive Data Visualizations for the Web.","logo":"/images/repo.png","name":"JavaScript InfoVis Toolkit","links":{"site":"http://thejit.org","github":"https://github.com/philogb/jit"},"tags":["charts","graphs"]}},{"title":"jQuery Sparklines","url":"/library/jquery-sparklines","id":"jquery-sparklines","library":{"id":"jquery-sparklines","description":"This jQuery plugin generates sparklines (small inline charts) directly in the browser using data supplied either inline in the HTML, or via javascript.\n\nThe plugin is compatible with most modern browsers and has been tested with Firefox 2+, Safari 3+, Opera 9, Google Chrome and Internet Explorer 6, 7, 8 & 9 as well as iOS and Android.","logo":"/images/repo.png","name":"jQuery Sparklines","links":{"site":"http://omnipotent.net/jquery.sparkline/","github":"https://github.com/gwatts/jquery.sparkline/"},"tags":["charts","jquery"]}},{"title":"Rickshaw","url":"/library/rickshaw","id":"rickshaw","library":{"id":"rickshaw","description":"Rickshaw is a JavaScript toolkit for creating interactive time series graphs","logo":"https://0.gravatar.com/avatar/f5b009f992e5912f42636c7f5fdc3502?d=https://a248.e.akamai.net/assets.github.com%2Fimages%2Fgravatars%2Fgravatar-org-420.png","name":"Rickshaw","links":{"site":"http://code.shutterstock.com/rickshaw/","github":"https://github.com/shutterstock/rickshaw"},"tags":["charts","d3.js"]}},{"title":"MilkChart","url":"/library/milkchart","id":"milkchart","library":{"id":"milkchart","description":"Graphing library for MooTools. This library will generate a graph similar to Microsoft Excel.","logo":"/images/repo.png","name":"MilkChart","links":{"github":"https://github.com/theiviaxx/MilkChart/"},"tags":["charts","mootools"]}},{"title":"EditGrid Grid API","url":"/library/editgrid-grid-api","id":"editgrid-grid-api","library":{"id":"editgrid-grid-api","description":"EditGrid is an Online Spreadsheet service delivering Data on Demand.\n\nOver 100,000 personal and business users are registered with EditGrid to collaborate on spreadsheets.\nSpreadsheet -\nWith majority of Excel features, EditGrid allows you to start working easily.\nOnline -\nWith sharing, collaboration & publishing features, EditGrid serves a big set of use cases better than Excel.\nData -\nConnected to live data sources, EditGrid delivers data on demand.","logo":"http://developer.editgrid.com/static/style/img/SiteLogo.gif","name":"EditGrid Grid API","links":{"site":"http://developer.editgrid.com/doc/gridapi-doc/"},"tags":["charts"]}},{"title":"Webix Charts","url":"/library/webix-charts","id":"webix-charts","library":{"id":"webix-charts","description":"HTML5/JavaScript Charts widget that presents data in spectacular graphic figures. It includes such popular chart types as line, spline, area, bar, pie, 3s pie, donut, scatter, and radar.\n\nYou can define the chart appearance by changing the design of all its elements, including the tooltip, color, scale, template and more.\nWebix Charts can load data from XML, JSON, JSArray and CSV formats with ease. Due to the high customizability of XML and JSON data formats, you can use the Chart with your existing web services too.\nWith Webix Charts you can develop a chart that has a line and bar series at the same time. \n\nThe data on Charts can be easily sorted according to particular parameters by clicking on special inbuilt buttons.\nYou can filter data in Webix Charts clicking on the buttons with filtering features.\n\nMultiple data sets can be presented on one Webix charts run across various browsers such as IE10, Mozilla Firefox, Opera, Chrome and Safari.\n\nWebix Charts support natural data mapping and accurately operates on all touch devices.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"Webix Charts","links":{"site":"http://webix.com/widget/charts/"},"tags":["JS","area","array","bar","chart","charts","column","cross-browser","donut","graphs","html5","json","pie","radar","scatter","series","stacked","webix","widget","xml"]}}]