[{"title":"Twelve-Space","url":"/library/twelve-space","id":"twelve-space","library":{"id":"twelve-space","description":"Twelve-Space is a structure system for creating relative containers for content based in twelves. The system keeps the structures fluid to meet design needs and to allow for flexibility to focus on the context of content not pixel dimensions.\n\nThe structure system is inspired by traditional grid systems but includes layering and expanding, allowing you to go off the grid.","logo":"http://nicetransition.com/twelve-space.png","name":"Twelve-Space","links":{"site":"https://kevinmack18.github.io/Twelve-Space/","github":"https://github.com/kevinmack18/Twelve-Space"},"tags":["architecture","column","containers","css","end","framework","front","grid","oocss","row","sass","space","structure","system","table","twelve"]}},{"title":"Webix Charts","url":"/library/webix-charts","id":"webix-charts","library":{"id":"webix-charts","description":"HTML5/JavaScript Charts widget that presents data in spectacular graphic figures. It includes such popular chart types as line, spline, area, bar, pie, 3s pie, donut, scatter, and radar.\n\nYou can define the chart appearance by changing the design of all its elements, including the tooltip, color, scale, template and more.\nWebix Charts can load data from XML, JSON, JSArray and CSV formats with ease. Due to the high customizability of XML and JSON data formats, you can use the Chart with your existing web services too.\nWith Webix Charts you can develop a chart that has a line and bar series at the same time. \n\nThe data on Charts can be easily sorted according to particular parameters by clicking on special inbuilt buttons.\nYou can filter data in Webix Charts clicking on the buttons with filtering features.\n\nMultiple data sets can be presented on one Webix charts run across various browsers such as IE10, Mozilla Firefox, Opera, Chrome and Safari.\n\nWebix Charts support natural data mapping and accurately operates on all touch devices.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"Webix Charts","links":{"site":"http://webix.com/widget/charts/"},"tags":["JS","area","array","bar","chart","charts","column","cross-browser","donut","graphs","html5","json","pie","radar","scatter","series","stacked","webix","widget","xml"]}}]