[{"title":"Gem.js","url":"/library/gem-js","id":"gem-js","library":{"id":"gem-js","description":"Gem.js is a view library - a system for building modular and composable web components and styles, as well as a set of extensible web components for building visual user interfaces and styling web applications in pure-javascript.","logo":"https://raw.githubusercontent.com/Tixit/Gem.js/master/gem.png","name":"Gem.js","links":{"github":"https://github.com/Tixit/Gem.js"},"tags":["angular","application","backbone","blocks","components","css","html","react","style","view","web"]}},{"title":"Zino UI","url":"/library/zino-ui","id":"zino-ui","library":{"id":"zino-ui","description":"Zino UI is a jQuery based, WAI-ARIA compatible, user interface framework consist of 25+ different components. Zino UI comes with HTML5 Canvas and SVG wrappers, Charts library and PHP server helpers.\n\nSome of widgets: datasource, datatable, treeview, selectbox, checkbox, combobox, radio group, button, spinner, progress bar, tabs, accordion, slider, slideshow, draggable, resizable, rating, calendar, tooltip, menu, ajax uploader.","logo":"https://zinoui.com/app/web/img/logo.png","name":"Zino UI","links":{"site":"https://zinoui.com"},"tags":["canvas","charts","components","jquery","svg","widgets"]}},{"title":"Custom Elements","url":"/library/custom-elements","id":"custom-elements","library":{"id":"custom-elements","description":"Custom elements are a part of the W3C Web Components specification http://w3c.github.io/webcomponents/spec/custom/. They allow you to define and register new HTML tags/elements in your documents. You can then use these tags as regular HTML.\n\nThis library polyfills the Custom Elements API on browsers today. It is a barebones fork of the X-Tag core library from Mozilla http://www.x-tags.org/. X-Tags in turn uses the Polymer polyfills from Google http://www.polymer-project.org/.\n\nThe aim of this library is to provide a stripped down version of the above polyfills, with zero additional weight.","logo":"https://www.dartlang.org/articles/web-ui/webcomponent_logo.jpg","name":"Custom Elements","links":{"github":"https://github.com/oliver-moran/custom-elements"},"tags":["Custom","Elements","components","html","web"]}},{"title":"Webix MultiView","url":"/library/webix-multiview","id":"webix-multiview","library":{"id":"webix-multiview","description":"Webix widget MultiView helps users use space on a web page efficiently. With this Webix widget, there is no need to open additional browser window. Now you can place different widgets in special panels that will be displayed within one area.\n\nYou can place any widget you wish inside Webix MultiView. ScrollView can be in one tab while Carousel is in another one. Users can quickly switch between these panels using the navigation tools provided.\n\nYou can easily define the appearance of MultiView widgets fully with CSS, which improves your SEO indicators and simplifies control of your widgets’ visual parts.\n\nThese Webix widgets run effectively on modern browsers such as IE10, Mozilla Firefox, Opera, Chrome and Safari.","logo":"http://webix.com/wp-content/themes/webix/images/logo_footer.png","name":"Webix MultiView","links":{"site":"http://webix.com/widget/multiview-scrollview-carousel/#multiview"},"tags":["components","javascript","multiview","ui","widgets"]}}]