[{"title":"Webix Calendar","url":"/library/webix-calendar","id":"webix-calendar","library":{"id":"webix-calendar","description":"Webix Calendar is a JavaScript single-month calendar that can be effortlessly included into your app or web page. This widget allows your end users to select days, months, years and even current time.\nWebix Calendar can be localized with the translation function that helps change the language of month and day names to whichever language is desired. Moreover, this JavaScript widget can show the week’s number and can be easily adapted to the local week’s starting day.\nIf you add a Webix calendar into your website or to be more precise connect with a text input form by using the control Datepicker, you’ll give your end-users the option to pick a desired date.\nCSS fully defines the appearance of Webix Calendar making it lightweight and easily managed.\nWebix Calendar is highly compatible with popular browsers such as IE10, Mozilla Firefox, Opera, Chrome and Safari.\nWebix Calendar can be used in mobile apps that operate on all modern touch devices like iPhone, iPad, Android devices.","logo":"http://webix.com/wp-content/themes/webix/images/logo_header.png","name":"Webix Calendar","links":{"site":"http://webix.com/widget/calendar"},"tags":["calendar","css","datepicker","javascript"]}},{"title":"DateTimePicker","url":"/library/datetimepicker","id":"datetimepicker","library":{"id":"datetimepicker","description":"Use this plugin to unobtrusively add a datetimepicker, datepicker or timepicker dropdown to your forms","logo":"https://github.com/xdan/datetimepicker/blob/master/screen/1.png?raw=true","name":"DateTimePicker","links":{"site":"http://xdsoft.net/jqplugins/datetimepicker/","github":"https://github.com/xdan/datetimepicker/"},"tags":["DateTime","Timepicker","calendar","date","datepicker","time"]}},{"title":"Gijgo","url":"/library/gijgo","id":"gijgo","library":{"id":"gijgo","description":"Gijgo is a set of free open source javascript controls distributed under MIT License. All widgets are high performance, built on top of the jQuery JavaScript Library and with built-in support for Bootstrap and Material Design. They are designed to saves you time and scales with your development process.","logo":"/images/repo.png","name":"Gijgo","links":{"site":"http://gijgo.com/","github":"https://github.com/atatanasov/gijgo"},"tags":["DropDown","WYSIWYG","bootstrap","checkbox","datagrid","datepicker","design","dialog","draggable","droppable","grid","javascript","jquery","material","modal","plugin","resizable","table","tree","treeview"]}},{"title":"ShieldUI DatePicker component ","url":"/library/shieldui-datepicker-component","id":"shieldui-datepicker-component","library":{"id":"shieldui-datepicker-component","description":"The ShieldUI DatePicker component - is a lightweight, very fast and highly customizable UI control which allows you to select a date and perform an action.\nThe control contains internally ShieldUI Calendar widget which allows you to navigate through days, months and years.\nThe DatePicker has rich client side API for interaction with the component.","logo":"https://pbs.twimg.com/profile_images/432842026199949312/AcLRAAXS_400x400.png","name":"ShieldUI DatePicker component ","links":{"site":"https://www.shieldui.com/documentation/datepicker"},"tags":["MVC","asp.net","datepicker","javascript","jquery"]}}]