[{"title":"Webix Kanban Board widget","url":"/library/webix-kanban-board-widget","id":"webix-kanban-board-widget","library":{"id":"webix-kanban-board-widget","description":"Webix Kanban is a JavaScript and HTML5 widget that can be used for building easy-to-use and feature-rich kanban boards.\n\nYou can add any number of task cards and columns, thanks to the flexible Webix Layout that is a main part of Webix Kanban.\n\nThe UI of Webix Kanban is fully configurable and can be easily customized and extended according to your requirements. You can add color highlighting, extra lists, team avatars, notifications, various HTML elements and more with ease. It all depends on your imagination.\n\nWith Webix Kanban Board, the members of your team are always aware of other participant’s progress in work that leads to increased communication and collaboration.","logo":"https://fbcdn-sphotos-b-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/1454761_651754051523746_676830629_n.png?oh=06b9ff82a83e00ce8b10cd9a346fe68d&oe=5521AFAF&__gda__=1428514348_303e7c6ac44388dfe7aa4259dcadf133","name":"Webix Kanban Board widget","links":{"site":"http://webix.com/kanban/"},"tags":["apps","board","development","javascript","kanban","web","widget"]}},{"title":"Webix BarCode","url":"/library/webix-barcode","id":"webix-barcode","library":{"id":"webix-barcode","description":"BarCode is a JavaScript widget that represents text values in a machine-readable format by interchanging the widths and spacing of parallel lines. You can embed generated barcodes into your web apps with minimum efforts. \n\nWebix Barcode includes 3 definitions for most popular barcodes: EAN8, EAN13 and UPC-A. If you need a new type of barcode, you may create your own one by using nice BarCode API.\n\nYou set the BarCode configuration in accordance with your preferences by defining its width, height and color as well as by adjusting the height of its text.","logo":"https://pbs.twimg.com/profile_images/378800000054262582/8ea5426795b3d478a4a94426f0ce4b4a_400x400.png","name":"Webix BarCode","links":{"site":"http://webix.com/widget/barcode/"},"tags":["app","barcode","development","javascript","web","widget"]}}]