[{"title":"Basic Primitives","url":"/library/basic-primitives","id":"basic-primitives","library":{"id":"basic-primitives","description":"Diagramming library - implements organizational and multi-parent hierarchical charts. Visualizes hierarchical structures using default or user defined HTML templates. Charts use custom layout algorithm auto fitting selected items of hierarchy into available space.  Organizational chart supports regular paper style Charts via implementing Assistant & Adviser parent-child relationships, matrix children layout and it has a number of UI interactivity enhancements to operate large over 500 items diagrams without manual partitioning on the screen.\n\nLarge Hierarchical Charts Visualization\nPaper style Organizational Charts\nMulti-parent hierarchical chart\nFamily Tree\nDependencies Chart\nPERT chart\nFinancial Ownership Diagram","logo":"http://www.basicprimitives.com/plugins/content/jw_sig/includes/images/transparent.gif","name":"Basic Primitives","links":{"site":"http://www.basicprimitives.com"},"tags":["angular","chart","dependencies","diagram","family","hierarchy","jquery","org","organizational","pert","tree","visualization","widget"]}},{"title":"dhtmlxDiagram","url":"/library/dhtmlxdiagram","id":"dhtmlxdiagram","library":{"id":"dhtmlxdiagram","description":"dhtmlxDiagram is a JavaScript diagram library that can help you with building nice diagrams and org charts org charts.\n\nThe library is fully customizable, cross-browser and can be simply integrated in any web app.","logo":"https://dhtmlx.com/blog/wp-content/uploads/2017/09/Diagram-dhtmlx.png","name":"dhtmlxDiagram","links":{"site":"https://dhtmlx.com/docs/products/dhtmlxDiagram/"},"tags":["chart","dhtmlx","diagram","javascript","library","organization"]}},{"title":"Webix Organogram","url":"/library/webix-organogram","id":"webix-organogram","library":{"id":"webix-organogram","description":"Organogram is a JavaScript Webix widget intended for creating hierarchical diagrams that display links between posts and jobs in an organization or represent various parts of a complex structure. Due to the fact that the structure and API of Organogram are similar to Webix Tree ones, you will spend less time on learning this component. You can customize the appearance of this JavaScript widget according to the requirements of your project. It is possible to adjust the size of Organogram items, their content, arrangement and even more. What is more, to make the widget more informative you can add different HTML-objects to its items.It is possible to adjust the whole style of Organogram or its separate elements through CSS. You may also apply your own CSS rules to create a unique style of this widget.f you have an organization with branched structure and want to display it in a comprehensible format, you can present child elements of some items in a list form.Webix Organogram allows loading data in JSON or XML data formats. These data formats are easily customizable therefore you can use Organogram with your existing web-services. Since Organogram widget is based on the TreeStore, you can load data from a database on the server as well.","logo":"https://pbs.twimg.com/profile_images/378800000054262582/8ea5426795b3d478a4a94426f0ce4b4a_400x400.png","name":"Webix Organogram","links":{"site":"http://webix.com/widget/organogram/"},"tags":["charts","diagram","javascript","organogram"]}},{"title":"GoJS","url":"/library/gojs","id":"gojs","library":{"id":"gojs","description":"GoJS is a library that allows JavaScript programmers to easily create customized canvas-based interactive diagrams. Customizable nodes, links, and layouts are some of its key features.","logo":"https://i.imgur.com/WHyFtPT.png","name":"GoJS","links":{"site":"http://gojs.net"},"tags":["chart","commercial","diagram"]}}]