[{"title":"jsPlumb","url":"/library/jsplumb","id":"jsplumb","library":{"id":"jsplumb","description":"Provides a means to visually connect DOM elements. Runs on jQuery, MooTools or YUI3, on all browsers from IE6 and up.","logo":"http://jsplumbtoolkit.com/logo-bw.png","name":"jsPlumb","links":{"site":"http://jsplumbtoolkit.com","github":"https://github.com/sporritt/jsplumb"},"tags":["canvas","graph","jquery","mootools","svg","yui"]}},{"title":"AnyChart JS","url":"/library/anychart-js","id":"anychart-js","library":{"id":"anychart-js","description":"AnyChart is a flexible, cross-platform and cross-browser JavaScript charting library that allows you to create interactive HTML5 charts, stock charts, maps, Gantt charts, and dashboards for any project, in any browser, and on any platform/OS.\n\nAnyChart provides advanced customization and flexibility opportunities, no matter if you are developing a website, a BI app for corporate use, or software for your clients. The library's JavaScript API allows you to create even big data based charts in real time, with continuous updates and multi-level drill-downs. You can use any server platform or database, and you will get amazing informative visualization on all devices - Macs, laptops, PCs, smartphones, and tablets.\n\nAnyChart has four main JavaScript/HTML5 charting solutions.\n\nAnyChart JS Charts and Dashboards provides scatter, line, bar, area, waterfall, spline, funnel, bubble, polar, column, columnrange, pie, box plot, angular gauge, areasplinerange, and many other types of charts available separately and in combination, with single or multiple axes.\n\nAnyStock Financial and Stock JS Charts converts any real-time data into sophisticated charts that can easily be made interactive. Scrolling, drill downs, zoom, and panning make Reports and Dashboards greatly visualized to facilitate reviewing long-term and big data sets while analyzing Forex, commodity, investment and other market data.\n\nAnyMap JS Maps is perfect for dashboards and side-by-side reporting. This HTML5 mapping solution helps you build interactive maps for any browser on any platform. Use it to display sales by region, election results, population density and other geo-related data.\n\nAnyGantt JS Gantt Charts allows you to utilize power of animation and ultimate interactivity to build complex and informative HTML5 Gantt charts, which can be used with ASP.NET, ASP, PHP, JSP, ColdFusion, Ruby on Rails or simple HTML pages to visualize data from any warehouse: text, Excel, CSV - MySQL, MS SQL, Oracle DB servers.","logo":"http://img.stackshare.io/service/3319/DzHriaGc.png","name":"AnyChart JS","links":{"site":"http://www.anychart.com"},"tags":["chart","charting","charts","commercial","gantt","graph","html5","javascript","visualization"]}},{"title":"morris.js","url":"/library/morris-js","id":"morris-js","library":{"id":"morris-js","description":"Making good-looking graphs shouldn't be hard. Morris.js is a lightweight library that uses jQuery and Raphaël to make drawing simple charts easy.","logo":"https://avatars.githubusercontent.com/u/6538127?v=2","name":"morris.js","links":{"site":"https://morrisjs.github.io/morris.js/","github":"https://github.com/morrisjs/morris.js"},"tags":["Raphaël","chart","charting","graph","graphing","svg"]}},{"title":"OLAPCharts","url":"/library/olapcharts","id":"olapcharts","library":{"id":"olapcharts","description":"OLAPCharts is a programming free JavaScript Chart engine.\n\nIt contains all basic charts and a growing number of advanced charts and is fully interactive and responsive.\n\nBut the main focus lies on multidimensional data processing and transformation to make building dashboards easy.","logo":"http://www.olapcharts.com/logo.gif","name":"OLAPCharts","links":{"site":"http://www.olapcharts.com"},"tags":["OLAP","charts","commercial","graph","html5","javascript","library"]}},{"title":"Liviz.js","url":"/library/liviz-js","id":"liviz-js","library":{"id":"liviz-js","description":"Interactive Graphviz in javascript.\nGraphviz is open source graph visualization software. Graph visualization is a way of representing structural information as diagrams of abstract graphs and networks. It has important applications in networking, bioinformatics,  software engineering, database and web design, machine learning, and in visual interfaces for other technical domains.\n\n*click up triangle next to play button on left side and \"Take a Tour\" or \"About\"","logo":"http://ushiroad.com/jsviz/images/livizlogo.png","name":"Liviz.js","links":{"github":"https://github.com/gyuque/livizjs"},"tags":["chart","graph"]}},{"title":"Flot","url":"/library/flot","id":"flot","library":{"id":"flot","description":"Flot is a pure JavaScript plotting library for jQuery, with a focus on simple usage, attractive looks and interactive features.\n\nWorks with Internet Explorer 6+, Chrome, Firefox 2+, Safari 3+ and Opera 9.5+","logo":"https://0.gravatar.com/avatar/0e042d87ce4acbfe24e18a95ed8c5064?d=https://a248.e.akamai.net/assets.github.com%2Fimages%2Fgravatars%2Fgravatar-org-420.png","name":"Flot","links":{"site":"http://www.flotcharts.org/","github":"https://github.com/flot/flot"},"tags":["chart","graph","jquery","plot"]}},{"title":"AnyMap JS","url":"/library/anymap-js","id":"anymap-js","library":{"id":"anymap-js","description":"AnyMap JavaScript mapping library helps you build interactive maps that look great in any browser on any platform.\n\nAnyMap is perfect for interactive dashboards and side-by-side reporting. You can use it to display sales by region, election results, population density or any other geo-related data.\n\nAnyMap JS maps are absolutely compatible with basic charts, stock charts and Gantt charts also offered by AnyChart http://www.anychart.com, and can be used as part of the dashboard as good as standalone map visualization solution.\n\nAnyMap comes with ready-to-use Maps Collection which you can use at no additional cost. Custom maps can be created from any SHP map.","logo":"https://drive.google.com/a/anychart.com/file/d/0B2Ym3TNPFjTpOFpoVWVGblNQWlU/view?usp=sharing","name":"AnyMap JS","links":{"site":"http://www.anychart.com/products/anymap"},"tags":["chart","charting","charts","commercial","gantt","graph","html5","javascript","visualization"]}},{"title":"Timesheet.js","url":"/library/timesheet-js","id":"timesheet-js","library":{"id":"timesheet-js","description":"Visualize your data and events with sexy HTML5 and CSS3. Create simple time sheets with sneaky JavaScript. Style them with CSS and have mobile fun as well …","logo":"https://raw.githubusercontent.com/sbstjn/timesheet.js/master/screen.png","name":"Timesheet.js","links":{"site":"https://sbstjn.github.io/timesheet.js","github":"https://github.com/sbstjn/timesheet.js"},"tags":["chart","gantt","graph","timesheet"]}},{"title":"k-d Tree JavaScript Library","url":"/library/k-d-tree-javascript-library","id":"k-d-tree-javascript-library","library":{"id":"k-d-tree-javascript-library","description":"A basic but super fast JavaScript implementation of the k-dimensional tree data structure.\n\nIn computer science, a k-d tree (short for k-dimensional tree) is a space-partitioning data structure for organizing points in a k-dimensional space. k-d trees are a useful data structure for several applications, such as searches involving a multidimensional search key (e.g. range searches and nearest neighbor searches). k-d trees are a special case of binary space partitioning trees.","logo":"https://0.gravatar.com/avatar/2ae539d62625c37ce8c3213eb273a04e?d=https://a248.e.akamai.net/assets.github.com%2Fimages%2Fgravatars%2Fgravatar-org-420.png","name":"k-d Tree JavaScript Library","links":{"github":"https://github.com/ubilabs/kd-tree-javascript"},"tags":["graph"]}},{"title":"CanvasJS","url":"/library/canvasjs","id":"canvasjs","library":{"id":"canvasjs","description":"CanvasJS is a standalone HTML5 & JavaScript Charting Library that works across devices including iPhone, iPad, Android, Desktops, etc. It performs 10x better than traditional SVG and Flash based Charts.","logo":"http://canvasjs.com/canvasjs-logo.png","name":"CanvasJS","links":{"site":"http://canvasjs.com/"},"tags":["canvas","chart","graph","html5","mobile"]}},{"title":"DHTMLX Chart","url":"/library/dhtmlx-chart","id":"dhtmlx-chart","library":{"id":"dhtmlx-chart","description":"dhtmlxChart is a Canvas-based JavaScript charting library. It allows you to generate nice-looking charts of different types: line, spline, area, bar, pie, donut, scatter, and radar charts. The charts are easily customizable and can load data from XML, JSON, JavaScript array, or CSV.\ndhtmlxChart is distributed under GNU GPL and commercial license.","logo":"http://www.dhtmlx.com/docs/products/dhtmlxChart/images/mini/bars.png","name":"DHTMLX Chart","links":{"site":"http://www.dhtmlx.com/docs/products/dhtmlxChart/index.shtml"},"tags":["chart","graph","html5"]}},{"title":"Sheetsee.js","url":"/library/sheetsee-js","id":"sheetsee-js","library":{"id":"sheetsee-js","description":"Sheetsee.js is a javascript library mashup that allows you to fill a website with content from a Google Spreadsheet. The web content and visualizations will update with every auto save by Google. That's cool. No pushing or uploading changes.","logo":"/images/repo.png","name":"Sheetsee.js","links":{"site":"https://jllord.github.com/sheetsee.js/","github":"https://github.com/jllord/sheetsee.js"},"tags":["cms","google","graph","spreadsheet","visualization"]}}]