[{"title":"JavaScript Pivot Table - Webix Pivot Table","url":"/library/javascript-pivot-table-webix-pivot-table","id":"javascript-pivot-table-webix-pivot-table","library":{"id":"javascript-pivot-table-webix-pivot-table","description":"Pivot is a JavaScript data analysis tool that can be embedded into your web page or web app. It can automatically count, sort, total or give the average of large data amounts.\n\nPivot appearance is defined fully with CSS that allows you to customize its view to the website style. This tool can load the report data from local drive or from external sources and allows exporting data as PDF file, Excel, CSV pages.\n\nThe pivot data structure can be transformed by dragging and dropping fields graphically.\n\nWebix Pivot can easily render up to millions of records with high loading speed.\nPivot table is fully client-side and runs perfectly on mobile devices, like iOS, Android devices, supporting all touch events.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"JavaScript Pivot Table - Webix Pivot Table","links":{"site":"http://pivot.webix.com/"},"tags":["javascript","pivot","table","web","webix"]}},{"title":"JavaScript Webix Pivot Chart","url":"/library/javascript-webix-pivot-chart","id":"javascript-webix-pivot-chart","library":{"id":"javascript-webix-pivot-chart","description":"Webix Pivot Chart is an interactive JavaScript tool that provides a graphical representation of the complex analytic data. It allows organizing, comparing and summarizing the data in charts.\n\nWebix Pivot Chart provides the following chart types: line chart, area chart, bar chart, and radar chart. The Pivot chart type can be changed as well as all its titles, legend placement, data labels and chart location. Moreover you may also choose which chart series to hide or show by simply clicking on the chart’s legend.\n\nLike a Webix Pivot Table the data representation in pivot chart report can be quickly changed by dragging and dropping its structure elements the way you like.","logo":"http://webix.com/","name":"JavaScript Webix Pivot Chart","links":{"site":"http://pivot.webix.com/chart.html"},"tags":["chart","drag-and-drop","javascript","pivot","table","webix"]}},{"title":"dhtmlxPivot","url":"/library/dhtmlxpivot","id":"dhtmlxpivot","library":{"id":"dhtmlxpivot","description":"It's a JavaScript Pivot table library for building powerful pivot grids that will help you to work with complex data. By using dhtmlxPivot, you'll be able to summarize large datasets and visualize them in a convenient way. \n\nMain features:\n\n\nintuitive drag-n-drop interface\nhigh performance\neasy configuration and customization of layout\nsimple localization to any language you need\ndata loading in the JSON format","logo":"https://dhtmlx.com/blog/wp-content/uploads/2017/08/20170809-Pivot-294x235-tiny.png","name":"dhtmlxPivot","links":{"site":"https://dhtmlx.com/docs/products/dhtmlxPivot/"},"tags":["grid","javascript","pivot","table"]}}]