[{"title":"Joosy","url":"/library/joosy","id":"joosy","library":{"id":"joosy","description":"Joosy is a javascript framework. Being a harmonious extensions to Rails it introduces everything you like about this framework right to your browser. Ready conventions set, extensive CoffeeScript, HAML support, Helpers, seamless backend integration, automatic code generation and more.","logo":"http://joosy.ws/joosy.png","name":"Joosy","links":{"site":"http://joosy.ws","github":"https://github.com/joosy/joosy"},"tags":["coffescript","rails","rest","ruby"]}},{"title":"abaaso","url":"/library/abaaso","id":"abaaso","library":{"id":"abaaso","description":"abaaso is an enterprise class, light weight, RESTful JavaScript framework that provides a set of classes and object prototyping to ease the creation and maintenance of pure JavaScript applications.","logo":"http://abaaso.com/assets/abaaso.png","name":"abaaso","links":{"site":"http://abaaso.com","github":"https://github.com/avoidwork/abaaso"},"tags":["GUI","HATEOAS","client","documents","proxy","reactive","rest","server"]}},{"title":"DozerJS","url":"/library/dozerjs","id":"dozerjs","library":{"id":"dozerjs","description":"Dozer is a system for rapidly developing services to support front-end applications.\n\nIt's not a framework, not a toolkit, rather Dozer aims to be a malleable and unopinionated foundation for developing RESTful API's and web services to support front-end development.\n\nDozer creates a core server environment using NodeJS and the Express framework then allows you to build api endpoints, database models, components and adapters which all work together to provide the services required on the front-end.","logo":"http://dozerjs.com/images/logo.png","name":"DozerJS","links":{"site":"http://www.dozerjs.com","github":"https://github.com/DozerJS/dozerjs"},"tags":["Node","express","framework","rest"]}},{"title":"Featers","url":"/library/featers","id":"featers","library":{"id":"featers","description":"Feathers is a small library that extends Express, one of the most popular web frameworks for NodeJS. It helps you to easily create shared RESTful web services and real-time APIs using SocketIO or other websocket libraries supported by Primus.","logo":"http://feathersjs.com/images/logo.png","name":"Featers","links":{"site":"http://feathersjs.com","github":"https://github.com/feathersjs/feathers"},"tags":["express","real-time","rest"]}},{"title":"REM","url":"/library/rem","id":"rem","library":{"id":"rem","description":"REM is a REST library that does away with excessive configuration, confusing authentication, and incomplete libraries. Whether using an existing API or writing your own, REM is the fewest lines of code between reading documentation and getting started. And with support for popular services built-in, you might never need another web service library.","logo":"/images/repo.png","name":"REM","links":{"github":"https://github.com/tcr/rem-js"},"tags":["api","rem","rest","stream"]}},{"title":"Deployd","url":"/library/deployd","id":"deployd","library":{"id":"deployd","description":"Deployd is an open source platform that makes it easy to build and deploy APIs for mobile and web apps. APIs built on Deployd allow phones, tablets, browsers, and any other client, to query, update, and sync your apps data. Unlike working with a traditional backend, there's no boilerplate, or configuration. Deployd works right out of the box.","logo":"http://deployd.com/img/logo.png","name":"Deployd","links":{"site":"http://www.deployd.com","github":"https://github.com/deployd/deployd"},"tags":["api","backend","rest","restful"]}},{"title":"Sails.js","url":"/library/sails-js","id":"sails-js","library":{"id":"sails-js","description":"Sails makes it easy to build custom, enterprise-grade Node.js apps. It is designed to emulate the familiar MVC pattern of frameworks like Ruby on Rails, but with support for the requirements of modern apps: data-driven APIs with a scalable, service-oriented architecture. It's especially good for building chat, realtime dashboards, or multiplayer games; but you can use it for any web application project - top to bottom.","logo":"http://sailsjs.org/images/logo_sails.png","name":"Sails.js","links":{"site":"http://sailsjs.org","github":"https://github.com/balderdashy/sails"},"tags":["express","node.js","rest","socket.io","stack","websocket"]}}]