[{"title":"Basic Primitives","url":"/library/basic-primitives","id":"basic-primitives","library":{"id":"basic-primitives","description":"Diagramming library - implements organizational and multi-parent hierarchical charts. Visualizes hierarchical structures using default or user defined HTML templates. Charts use custom layout algorithm auto fitting selected items of hierarchy into available space.  Organizational chart supports regular paper style Charts via implementing Assistant & Adviser parent-child relationships, matrix children layout and it has a number of UI interactivity enhancements to operate large over 500 items diagrams without manual partitioning on the screen.\n\nLarge Hierarchical Charts Visualization\nPaper style Organizational Charts\nMulti-parent hierarchical chart\nFamily Tree\nDependencies Chart\nPERT chart\nFinancial Ownership Diagram","logo":"http://www.basicprimitives.com/plugins/content/jw_sig/includes/images/transparent.gif","name":"Basic Primitives","links":{"site":"http://www.basicprimitives.com"},"tags":["angular","chart","dependencies","diagram","family","hierarchy","jquery","org","organizational","pert","tree","visualization","widget"]}},{"title":"Treeview","url":"/library/treeview","id":"treeview","library":{"id":"treeview","description":"Lightweight and flexible transformation of an unordered list into an expandable and collapsable tree, great for unobtrusive navigation enhancements. Supports both location and cookie based persistence.\n\nProvides some options for customizing, an async-tree extension and an experimental sortable extension.","logo":"/images/repo.png","name":"Treeview","links":{"site":"http://bassistance.de/jquery-plugins/jquery-plugin-treeview/","github":"https://github.com/jzaefferer/jquery-treeview"},"tags":["jquery","tree","treeview"]}},{"title":"jqTree","url":"/library/jqtree","id":"jqtree","library":{"id":"jqtree","description":"jqTree is a tree widget.\n\n\nCreate a tree from JSON data\nDrag and drop\nWorks on ie7+, firefox 3.6+, chrome and safari\nWritten in Coffeescript","logo":"/images/repo.png","name":"jqTree","links":{"site":"https://mbraak.github.com/jqTree/","github":"https://github.com/mbraak/jqTree"},"tags":["coffeescript","jquery","json","tree"]}},{"title":"Gijgo","url":"/library/gijgo","id":"gijgo","library":{"id":"gijgo","description":"Gijgo is a set of free open source javascript controls distributed under MIT License. All widgets are high performance, built on top of the jQuery JavaScript Library and with built-in support for Bootstrap and Material Design. They are designed to saves you time and scales with your development process.","logo":"/images/repo.png","name":"Gijgo","links":{"site":"http://gijgo.com/","github":"https://github.com/atatanasov/gijgo"},"tags":["DropDown","WYSIWYG","bootstrap","checkbox","datagrid","datepicker","design","dialog","draggable","droppable","grid","javascript","jquery","material","modal","plugin","resizable","table","tree","treeview"]}},{"title":"Webix Tree","url":"/library/webix-tree","id":"webix-tree","library":{"id":"webix-tree","description":"Tree allows you to present hierarchically organized data in a nice and logical manner. With the help of this Webix widget you can clearly see all levels of dependency within the data.\nDynamic Data Loading allows asynchronous tree level loading. Initially, only first-level items are loaded. Then when you open the following tree branch, the ID of the branch is sent to server and the data is dynamically loaded.\nWebix Tree provides you with keyboard navigation and hotkey management, which allows you to make fewer manipulations as you work on the widget.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"Webix Tree","links":{"site":"http://webix.com/widget/tree"},"tags":["javascript","tree","treemenu","webix"]}},{"title":"Webix TreeTable","url":"/library/webix-treetable","id":"webix-treetable","library":{"id":"webix-treetable","description":"Webix TreeTable is a JavaScript widget for when you need to combine datatable and datatree functions in one widget. This hybrid structure shares certain properties of DataTable, such as filtering, selection by cells, and data export, to Excel and PDF. Like a treeview, it enables data visualization in a hierarchical manner and restores the saved widget state.\nThe TreeTable makes a full range of manipulations on the grid. You can easily edit its contents by clicking on one of the cells, selecting from a list with the help of a drop-down menu, or selecting/deselecting necessary items through the use of checkboxes.\nYou can easily save the current state of a TreeTable in order to return to it later with the help of two built-in one-click functions.\nTreeTable allows you to specify different types of selections with the help of the following available selection modes: cell, row, column, multi cell, multi row, multi column, block selection.\nTreetable allows exporting its data to PDF and Excel file types for further processing. You can also define the appearance of the table after it’s exported by configuring various server-side options.\nWebix TreeTable enables you to make drag-and-drop operations within TreeTable, as well as between TreeTable and Datatable, List, Tree and Dataview.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"Webix TreeTable","links":{"site":"http://webix.com/widget/treetable"},"tags":["grid","javascript","tree","treegrid","treetable","webix"]}},{"title":"NewickJS","url":"/library/newickjs","id":"newickjs","library":{"id":"newickjs","description":"JavaScript library for parsing and working with the Newick format.","logo":"http://tribunsky.com/img/newick_logo.png","name":"NewickJS","links":{"site":"http://tribunsky.com","github":"https://github.com/octav47/NewickJS"},"tags":["JS","newick","parser","tree"]}},{"title":"jsTree","url":"/library/jstree","id":"jstree","library":{"id":"jstree","description":"jsTree is a javascript based, cross browser tree component.","logo":"http://static.jstree.com/images/logo.png","name":"jsTree","links":{"site":"http://jstree.com","github":"https://github.com/vakata/jstree"},"tags":["jquery","tree"]}}]