[{"title":"Basic Primitives","url":"/library/basic-primitives","id":"basic-primitives","library":{"id":"basic-primitives","description":"Diagramming library - implements organizational and multi-parent hierarchical charts. Visualizes hierarchical structures using default or user defined HTML templates. Charts use custom layout algorithm auto fitting selected items of hierarchy into available space.  Organizational chart supports regular paper style Charts via implementing Assistant & Adviser parent-child relationships, matrix children layout and it has a number of UI interactivity enhancements to operate large over 500 items diagrams without manual partitioning on the screen.\n\nLarge Hierarchical Charts Visualization\nPaper style Organizational Charts\nMulti-parent hierarchical chart\nFamily Tree\nDependencies Chart\nPERT chart\nFinancial Ownership Diagram","logo":"http://www.basicprimitives.com/plugins/content/jw_sig/includes/images/transparent.gif","name":"Basic Primitives","links":{"site":"http://www.basicprimitives.com"},"tags":["angular","chart","dependencies","diagram","family","hierarchy","jquery","org","organizational","pert","tree","visualization","widget"]}},{"title":"AnyChart JS","url":"/library/anychart-js","id":"anychart-js","library":{"id":"anychart-js","description":"AnyChart is a flexible, cross-platform and cross-browser JavaScript charting library that allows you to create interactive HTML5 charts, stock charts, maps, Gantt charts, and dashboards for any project, in any browser, and on any platform/OS.\n\nAnyChart provides advanced customization and flexibility opportunities, no matter if you are developing a website, a BI app for corporate use, or software for your clients. The library's JavaScript API allows you to create even big data based charts in real time, with continuous updates and multi-level drill-downs. You can use any server platform or database, and you will get amazing informative visualization on all devices - Macs, laptops, PCs, smartphones, and tablets.\n\nAnyChart has four main JavaScript/HTML5 charting solutions.\n\nAnyChart JS Charts and Dashboards provides scatter, line, bar, area, waterfall, spline, funnel, bubble, polar, column, columnrange, pie, box plot, angular gauge, areasplinerange, and many other types of charts available separately and in combination, with single or multiple axes.\n\nAnyStock Financial and Stock JS Charts converts any real-time data into sophisticated charts that can easily be made interactive. Scrolling, drill downs, zoom, and panning make Reports and Dashboards greatly visualized to facilitate reviewing long-term and big data sets while analyzing Forex, commodity, investment and other market data.\n\nAnyMap JS Maps is perfect for dashboards and side-by-side reporting. This HTML5 mapping solution helps you build interactive maps for any browser on any platform. Use it to display sales by region, election results, population density and other geo-related data.\n\nAnyGantt JS Gantt Charts allows you to utilize power of animation and ultimate interactivity to build complex and informative HTML5 Gantt charts, which can be used with ASP.NET, ASP, PHP, JSP, ColdFusion, Ruby on Rails or simple HTML pages to visualize data from any warehouse: text, Excel, CSV - MySQL, MS SQL, Oracle DB servers.","logo":"http://img.stackshare.io/service/3319/DzHriaGc.png","name":"AnyChart JS","links":{"site":"http://www.anychart.com"},"tags":["chart","charting","charts","commercial","gantt","graph","html5","javascript","visualization"]}},{"title":"Koolchart","url":"/library/koolchart","id":"koolchart","library":{"id":"koolchart","description":"KoolChart offers 90+ types of charts, which have animation, 3D and gradient effects. Beyond the basic offerings, KoolChart provides advanced functions and chart types such as real-time monitoring chart, target vs actual chart, slide chart and candlestick chart in a single product package.","logo":"http://www.koolchart.com/images/html5_javascript_chart.png","name":"Koolchart","links":{"site":"http://www.koolchart.com","github":"https://github.com/Koolchart/Koolchart"},"tags":["bubble","chart","charts","data","free","graphs","html5","javascript","koolchart","library","line","visualization"]}},{"title":"AnyMap JS","url":"/library/anymap-js","id":"anymap-js","library":{"id":"anymap-js","description":"AnyMap JavaScript mapping library helps you build interactive maps that look great in any browser on any platform.\n\nAnyMap is perfect for interactive dashboards and side-by-side reporting. You can use it to display sales by region, election results, population density or any other geo-related data.\n\nAnyMap JS maps are absolutely compatible with basic charts, stock charts and Gantt charts also offered by AnyChart http://www.anychart.com, and can be used as part of the dashboard as good as standalone map visualization solution.\n\nAnyMap comes with ready-to-use Maps Collection which you can use at no additional cost. Custom maps can be created from any SHP map.","logo":"https://drive.google.com/a/anychart.com/file/d/0B2Ym3TNPFjTpOFpoVWVGblNQWlU/view?usp=sharing","name":"AnyMap JS","links":{"site":"http://www.anychart.com/products/anymap"},"tags":["chart","charting","charts","commercial","gantt","graph","html5","javascript","visualization"]}},{"title":"dex.js","url":"/library/dex-js","id":"dex-js","library":{"id":"dex-js","description":"dex.js is a visualization framework built for the modern web. dex.js provides a common reusable framework for achieving effective interactive data visualizations using a simple and consistent interface.\n\ndex.js unifies a number of charts from other frameworks and offers a few unique variants of it’s own and allows them to safely interoperate within a single web page.","logo":"https://dexjs.net/images/dexjs_logo.png","name":"dex.js","links":{"site":"https://dexjs.net/","github":"https://github.com/PatMartin/dexjs"},"tags":["visualization"]}},{"title":"Sheetsee.js","url":"/library/sheetsee-js","id":"sheetsee-js","library":{"id":"sheetsee-js","description":"Sheetsee.js is a javascript library mashup that allows you to fill a website with content from a Google Spreadsheet. The web content and visualizations will update with every auto save by Google. That's cool. No pushing or uploading changes.","logo":"/images/repo.png","name":"Sheetsee.js","links":{"site":"https://jllord.github.com/sheetsee.js/","github":"https://github.com/jllord/sheetsee.js"},"tags":["cms","google","graph","spreadsheet","visualization"]}},{"title":"vis.js","url":"/library/vis-js","id":"vis-js","library":{"id":"vis-js","description":"A dynamic, browser based visualization library. The library is designed to be easy to use, to handle large amounts of dynamic data, and to enable manipulation of and interaction with the data. The library consists of the components DataSet, Timeline, Network, Graph2d and Graph3d","logo":"/images/repo.png","name":"vis.js","links":{"site":"http://visjs.org","github":"https://github.com/almende/vis"},"tags":["visualization"]}}]