[{"title":"JavaScript Pivot Table - Webix Pivot Table","url":"/library/javascript-pivot-table-webix-pivot-table","id":"javascript-pivot-table-webix-pivot-table","library":{"id":"javascript-pivot-table-webix-pivot-table","description":"Pivot is a JavaScript data analysis tool that can be embedded into your web page or web app. It can automatically count, sort, total or give the average of large data amounts.\n\nPivot appearance is defined fully with CSS that allows you to customize its view to the website style. This tool can load the report data from local drive or from external sources and allows exporting data as PDF file, Excel, CSV pages.\n\nThe pivot data structure can be transformed by dragging and dropping fields graphically.\n\nWebix Pivot can easily render up to millions of records with high loading speed.\nPivot table is fully client-side and runs perfectly on mobile devices, like iOS, Android devices, supporting all touch events.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"JavaScript Pivot Table - Webix Pivot Table","links":{"site":"http://pivot.webix.com/"},"tags":["javascript","pivot","table","web","webix"]}},{"title":"JavaScript Webix Pivot Chart","url":"/library/javascript-webix-pivot-chart","id":"javascript-webix-pivot-chart","library":{"id":"javascript-webix-pivot-chart","description":"Webix Pivot Chart is an interactive JavaScript tool that provides a graphical representation of the complex analytic data. It allows organizing, comparing and summarizing the data in charts.\n\nWebix Pivot Chart provides the following chart types: line chart, area chart, bar chart, and radar chart. The Pivot chart type can be changed as well as all its titles, legend placement, data labels and chart location. Moreover you may also choose which chart series to hide or show by simply clicking on the chart’s legend.\n\nLike a Webix Pivot Table the data representation in pivot chart report can be quickly changed by dragging and dropping its structure elements the way you like.","logo":"http://webix.com/","name":"JavaScript Webix Pivot Chart","links":{"site":"http://pivot.webix.com/chart.html"},"tags":["chart","drag-and-drop","javascript","pivot","table","webix"]}},{"title":"Webix Tree","url":"/library/webix-tree","id":"webix-tree","library":{"id":"webix-tree","description":"Tree allows you to present hierarchically organized data in a nice and logical manner. With the help of this Webix widget you can clearly see all levels of dependency within the data.\nDynamic Data Loading allows asynchronous tree level loading. Initially, only first-level items are loaded. Then when you open the following tree branch, the ID of the branch is sent to server and the data is dynamically loaded.\nWebix Tree provides you with keyboard navigation and hotkey management, which allows you to make fewer manipulations as you work on the widget.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"Webix Tree","links":{"site":"http://webix.com/widget/tree"},"tags":["javascript","tree","treemenu","webix"]}},{"title":"Webix TreeTable","url":"/library/webix-treetable","id":"webix-treetable","library":{"id":"webix-treetable","description":"Webix TreeTable is a JavaScript widget for when you need to combine datatable and datatree functions in one widget. This hybrid structure shares certain properties of DataTable, such as filtering, selection by cells, and data export, to Excel and PDF. Like a treeview, it enables data visualization in a hierarchical manner and restores the saved widget state.\nThe TreeTable makes a full range of manipulations on the grid. You can easily edit its contents by clicking on one of the cells, selecting from a list with the help of a drop-down menu, or selecting/deselecting necessary items through the use of checkboxes.\nYou can easily save the current state of a TreeTable in order to return to it later with the help of two built-in one-click functions.\nTreeTable allows you to specify different types of selections with the help of the following available selection modes: cell, row, column, multi cell, multi row, multi column, block selection.\nTreetable allows exporting its data to PDF and Excel file types for further processing. You can also define the appearance of the table after it’s exported by configuring various server-side options.\nWebix TreeTable enables you to make drag-and-drop operations within TreeTable, as well as between TreeTable and Datatable, List, Tree and Dataview.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"Webix TreeTable","links":{"site":"http://webix.com/widget/treetable"},"tags":["grid","javascript","tree","treegrid","treetable","webix"]}},{"title":"Webix Uploader","url":"/library/webix-uploader","id":"webix-uploader","library":{"id":"webix-uploader","description":"Webix Uploader allows you to browse directories in your PC and choose the files to upload. It also supports dragging-and-dropping files into its work area.\nWebix Uploader allows uploading multiple files to the server at once with setting restrictions on the amount of files being uploaded.\nUploader feature progress bar enables your end user can keep track of the upload speed.\nInvisible uploader lets you trigger the process of uploading without pushing the dedicated control. It is used alongside data management widgets and allows you to edit pictures client side.\nUploader can be included into the document body section inside HTML form tags.","logo":"http://webix.com/wp-content/uploads/2013/10/webix-w-70x58.png","name":"Webix Uploader","links":{"site":"http://webix.com/widget/uploader"},"tags":["bar","files","invisible","multiple","progress","upload","uploader","webix"]}},{"title":"Webix Charts","url":"/library/webix-charts","id":"webix-charts","library":{"id":"webix-charts","description":"HTML5/JavaScript Charts widget that presents data in spectacular graphic figures. It includes such popular chart types as line, spline, area, bar, pie, 3s pie, donut, scatter, and radar.\n\nYou can define the chart appearance by changing the design of all its elements, including the tooltip, color, scale, template and more.\nWebix Charts can load data from XML, JSON, JSArray and CSV formats with ease. Due to the high customizability of XML and JSON data formats, you can use the Chart with your existing web services too.\nWith Webix Charts you can develop a chart that has a line and bar series at the same time. \n\nThe data on Charts can be easily sorted according to particular parameters by clicking on special inbuilt buttons.\nYou can filter data in Webix Charts clicking on the buttons with filtering features.\n\nMultiple data sets can be presented on one Webix charts run across various browsers such as IE10, Mozilla Firefox, Opera, Chrome and Safari.\n\nWebix Charts support natural data mapping and accurately operates on all touch devices.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"Webix Charts","links":{"site":"http://webix.com/widget/charts/"},"tags":["JS","area","array","bar","chart","charts","column","cross-browser","donut","graphs","html5","json","pie","radar","scatter","series","stacked","webix","widget","xml"]}}]