[{"title":"Closure Widgets","url":"/library/closure-widgets","id":"closure-widgets","library":{"id":"closure-widgets","description":"A growing set of widgets built on top of the Closure Library (in particular the goog.ui package). Includes drop-down menus, drag&drop and form handling","logo":"/images/repo.png","name":"Closure Widgets","links":{"github":"https://github.com/rhysbrettbowen/closure-widgets"},"tags":["Closure","ui","widgets"]}},{"title":"Zino UI","url":"/library/zino-ui","id":"zino-ui","library":{"id":"zino-ui","description":"Zino UI is a jQuery based, WAI-ARIA compatible, user interface framework consist of 25+ different components. Zino UI comes with HTML5 Canvas and SVG wrappers, Charts library and PHP server helpers.\n\nSome of widgets: datasource, datatable, treeview, selectbox, checkbox, combobox, radio group, button, spinner, progress bar, tabs, accordion, slider, slideshow, draggable, resizable, rating, calendar, tooltip, menu, ajax uploader.","logo":"https://zinoui.com/app/web/img/logo.png","name":"Zino UI","links":{"site":"https://zinoui.com"},"tags":["canvas","charts","components","jquery","svg","widgets"]}},{"title":"Webix MultiView","url":"/library/webix-multiview","id":"webix-multiview","library":{"id":"webix-multiview","description":"Webix widget MultiView helps users use space on a web page efficiently. With this Webix widget, there is no need to open additional browser window. Now you can place different widgets in special panels that will be displayed within one area.\n\nYou can place any widget you wish inside Webix MultiView. ScrollView can be in one tab while Carousel is in another one. Users can quickly switch between these panels using the navigation tools provided.\n\nYou can easily define the appearance of MultiView widgets fully with CSS, which improves your SEO indicators and simplifies control of your widgets’ visual parts.\n\nThese Webix widgets run effectively on modern browsers such as IE10, Mozilla Firefox, Opera, Chrome and Safari.","logo":"http://webix.com/wp-content/themes/webix/images/logo_footer.png","name":"Webix MultiView","links":{"site":"http://webix.com/widget/multiview-scrollview-carousel/#multiview"},"tags":["components","javascript","multiview","ui","widgets"]}}]