[{"title":"Basic Primitives","url":"/library/basic-primitives","id":"basic-primitives","library":{"id":"basic-primitives","description":"Diagramming library - implements organizational and multi-parent hierarchical charts. Visualizes hierarchical structures using default or user defined HTML templates. Charts use custom layout algorithm auto fitting selected items of hierarchy into available space.  Organizational chart supports regular paper style Charts via implementing Assistant & Adviser parent-child relationships, matrix children layout and it has a number of UI interactivity enhancements to operate large over 500 items diagrams without manual partitioning on the screen.\n\nLarge Hierarchical Charts Visualization\nPaper style Organizational Charts\nMulti-parent hierarchical chart\nFamily Tree\nDependencies Chart\nPERT chart\nFinancial Ownership Diagram","logo":"http://www.basicprimitives.com/plugins/content/jw_sig/includes/images/transparent.gif","name":"Basic Primitives","links":{"site":"http://www.basicprimitives.com"},"tags":["angular","chart","dependencies","diagram","family","hierarchy","jquery","org","organizational","pert","tree","visualization","widget"]}},{"title":"Webix Kanban Board widget","url":"/library/webix-kanban-board-widget","id":"webix-kanban-board-widget","library":{"id":"webix-kanban-board-widget","description":"Webix Kanban is a JavaScript and HTML5 widget that can be used for building easy-to-use and feature-rich kanban boards.\n\nYou can add any number of task cards and columns, thanks to the flexible Webix Layout that is a main part of Webix Kanban.\n\nThe UI of Webix Kanban is fully configurable and can be easily customized and extended according to your requirements. You can add color highlighting, extra lists, team avatars, notifications, various HTML elements and more with ease. It all depends on your imagination.\n\nWith Webix Kanban Board, the members of your team are always aware of other participant’s progress in work that leads to increased communication and collaboration.","logo":"https://fbcdn-sphotos-b-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/1454761_651754051523746_676830629_n.png?oh=06b9ff82a83e00ce8b10cd9a346fe68d&oe=5521AFAF&__gda__=1428514348_303e7c6ac44388dfe7aa4259dcadf133","name":"Webix Kanban Board widget","links":{"site":"http://webix.com/kanban/"},"tags":["apps","board","development","javascript","kanban","web","widget"]}},{"title":"Webix BarCode","url":"/library/webix-barcode","id":"webix-barcode","library":{"id":"webix-barcode","description":"BarCode is a JavaScript widget that represents text values in a machine-readable format by interchanging the widths and spacing of parallel lines. You can embed generated barcodes into your web apps with minimum efforts. \n\nWebix Barcode includes 3 definitions for most popular barcodes: EAN8, EAN13 and UPC-A. If you need a new type of barcode, you may create your own one by using nice BarCode API.\n\nYou set the BarCode configuration in accordance with your preferences by defining its width, height and color as well as by adjusting the height of its text.","logo":"https://pbs.twimg.com/profile_images/378800000054262582/8ea5426795b3d478a4a94426f0ce4b4a_400x400.png","name":"Webix BarCode","links":{"site":"http://webix.com/widget/barcode/"},"tags":["app","barcode","development","javascript","web","widget"]}},{"title":"RaptorJS","url":"/library/raptorjs","id":"raptorjs","library":{"id":"raptorjs","description":"RaptorJS is an open-source toolkit for building JavaScript modules and UI components that function on the server and in the browser. RaptorJS promotes modularity, which is crucial to building reasonably complex HTML web applications that are maintainable, easily testable, and optimized. The central goal of RaptorJS is to enable applications to provide the best user experience.\n\nAs an eBay project, RaptorJS was designed to be extremely efficient and lightweight. Rather than being a monolithic framework, RaptorJS embraces a modular design; it is intended to work alongside existing JavaScript libraries—not replace them.","logo":"https://raw.github.com/raptorjs/branding/master/raptorjs-logo-square.png","name":"RaptorJS","links":{"github":"https://github.com/raptorjs/raptorjs"},"tags":["Node","amd","component","loader","templating","toolkit","ui","widget"]}},{"title":"Webix Charts","url":"/library/webix-charts","id":"webix-charts","library":{"id":"webix-charts","description":"HTML5/JavaScript Charts widget that presents data in spectacular graphic figures. It includes such popular chart types as line, spline, area, bar, pie, 3s pie, donut, scatter, and radar.\n\nYou can define the chart appearance by changing the design of all its elements, including the tooltip, color, scale, template and more.\nWebix Charts can load data from XML, JSON, JSArray and CSV formats with ease. Due to the high customizability of XML and JSON data formats, you can use the Chart with your existing web services too.\nWith Webix Charts you can develop a chart that has a line and bar series at the same time. \n\nThe data on Charts can be easily sorted according to particular parameters by clicking on special inbuilt buttons.\nYou can filter data in Webix Charts clicking on the buttons with filtering features.\n\nMultiple data sets can be presented on one Webix charts run across various browsers such as IE10, Mozilla Firefox, Opera, Chrome and Safari.\n\nWebix Charts support natural data mapping and accurately operates on all touch devices.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"Webix Charts","links":{"site":"http://webix.com/widget/charts/"},"tags":["JS","area","array","bar","chart","charts","column","cross-browser","donut","graphs","html5","json","pie","radar","scatter","series","stacked","webix","widget","xml"]}},{"title":"Webix Portlet","url":"/library/webix-portlet","id":"webix-portlet","library":{"id":"webix-portlet","description":"Portlet is a pluggable JavaScript component that allows placing other widgets inside of it and creating a flexible page layout. It is possible to drag portlets around the page, which enables changing the app’s structure without writing extra code for it.\n\nThere are three different modes for moving portlets. The first option implies replacing the target portlet with the moved one. The second variant allows portlets to be moved only along the x-axis, thus creating only columns. With the third mode, you can place portlets just along the y-axis. In this case the row structure will be built.\n\nYou can easily drag-and-drop portlets with its handler. It can be placed either as a column or as a row. What is more, a new possible position of portlet is highlighted.","logo":"https://pbs.twimg.com/profile_images/378800000054262582/8ea5426795b3d478a4a94426f0ce4b4a.png","name":"Webix Portlet","links":{"site":"http://webix.com/widget/portlet/"},"tags":["javascript.","portal.","portlet","widget"]}}]