[{"title":"SoftXpath","url":"/library/softxpath","id":"softxpath","library":{"id":"softxpath","description":"Lightweight cross browser JavaScript library for parsing complex XML documents using powerful Xpath expressions.","logo":"http://www.softxml.com/images/softxml-icon.png","name":"SoftXpath","links":{"site":"http://www.softxml.com/SoftXPathDemo.htm","github":"https://github.com/softxml/SoftXpath"},"tags":["javascript","parsing","xml","xpath"]}},{"title":"Webix DataTable","url":"/library/webix-datatable","id":"webix-datatable","library":{"id":"webix-datatable","description":"Cross-browser DataTable is a powerful JavaScript grid control built with an innovative approach and the latest web development trends in mind. \nIt’s currently one of the fastest JavaScript grid solutions ever created.Speed tests showed that DataTable loads 1,000 rows and columns 10 times faster than other grid libraries currently on the market.\nA powerful and feature-rich grid can now fit in a .js file of 38 Kb (gzipped).\nDataTable supports the display of tree-like structures, similar to what Tree offers.\nDataTable can load data from XML, JSON and CSV files and also allows you to use your own formats of data. \nDataTable provides built-in integration with jQuery framework. \nThe appearance of DataTable is defined fully with CSS, making the grid highly customizable.\nDataTable can be used in mobile web apps that run on touch devices. The user interface is optimized for touch screens.\nColumn and row height and width can be changed by dragging the vertical and horizontal borders of the table.\nYou can create a grid with two frozen areas on the left and right sides with scrollable columns in between.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"Webix DataTable","links":{"site":"http://webix.com/widget/datatable"},"tags":["CSV","control","datatable","grid","javascript","json","treetable","xml"]}},{"title":"Webix Charts","url":"/library/webix-charts","id":"webix-charts","library":{"id":"webix-charts","description":"HTML5/JavaScript Charts widget that presents data in spectacular graphic figures. It includes such popular chart types as line, spline, area, bar, pie, 3s pie, donut, scatter, and radar.\n\nYou can define the chart appearance by changing the design of all its elements, including the tooltip, color, scale, template and more.\nWebix Charts can load data from XML, JSON, JSArray and CSV formats with ease. Due to the high customizability of XML and JSON data formats, you can use the Chart with your existing web services too.\nWith Webix Charts you can develop a chart that has a line and bar series at the same time. \n\nThe data on Charts can be easily sorted according to particular parameters by clicking on special inbuilt buttons.\nYou can filter data in Webix Charts clicking on the buttons with filtering features.\n\nMultiple data sets can be presented on one Webix charts run across various browsers such as IE10, Mozilla Firefox, Opera, Chrome and Safari.\n\nWebix Charts support natural data mapping and accurately operates on all touch devices.","logo":"http://webix.com/wp-content/uploads/2013/09/Webix32x32.png","name":"Webix Charts","links":{"site":"http://webix.com/widget/charts/"},"tags":["JS","area","array","bar","chart","charts","column","cross-browser","donut","graphs","html5","json","pie","radar","scatter","series","stacked","webix","widget","xml"]}}]