[{"title":"Javascript Finite State Machine","url":"/library/javascript-finite-state-machine","id":"javascript-finite-state-machine","library":{"id":"javascript-finite-state-machine","description":"A finite state machine javascript micro framework","logo":"/images/repo.png","name":"Javascript Finite State Machine","links":{"site":"http://codeincomplete.com/posts/2013/1/26/javascript_state_machine_v2_2_0/","github":"https://github.com/jakesgordon/javascript-state-machine"},"tags":["commercial","statemachine"]}},{"title":"RoyalSlider","url":"/library/royalslider","id":"royalslider","library":{"id":"royalslider","description":"RoyalSlider is easy to use jQuery image gallery and content slider plugin with animated captions, responsive layout and touch support for mobile devices. As navigation you can use thumbnails, tabs or bullets. Use it as image slider, slideshow, HTML content slider, gallery, banner rotator, video gallery, carousel or even presentation. Developed in best practises of HTML5 , CSS3 transitions are used for all animations (with fallback).","logo":"/images/repo.png","name":"RoyalSlider","links":{"site":"http://dimsemenov.com/plugins/royal-slider/"},"tags":["commercial","jquery","slider"]}},{"title":"PlayCanvas","url":"/library/playcanvas","id":"playcanvas","library":{"id":"playcanvas","description":"Cloud-based 3D HTML5 engine and toolset. Full JS engine, real-time collaborative designer tools. Support for 3D art packages.","logo":"https://s3.amazonaws.com/photos.angel.co/startups/i/120160-541e04926e9a5da9c136ab3e7caa5d44-medium_jpg.jpg?buster=1346927999","name":"PlayCanvas","links":{"site":"http://playcanvas.com/"},"tags":["3d","audio","canvas","commercial","html5","webgl"]}},{"title":"AnyChart JS","url":"/library/anychart-js","id":"anychart-js","library":{"id":"anychart-js","description":"AnyChart is a flexible, cross-platform and cross-browser JavaScript charting library that allows you to create interactive HTML5 charts, stock charts, maps, Gantt charts, and dashboards for any project, in any browser, and on any platform/OS.\n\nAnyChart provides advanced customization and flexibility opportunities, no matter if you are developing a website, a BI app for corporate use, or software for your clients. The library's JavaScript API allows you to create even big data based charts in real time, with continuous updates and multi-level drill-downs. You can use any server platform or database, and you will get amazing informative visualization on all devices - Macs, laptops, PCs, smartphones, and tablets.\n\nAnyChart has four main JavaScript/HTML5 charting solutions.\n\nAnyChart JS Charts and Dashboards provides scatter, line, bar, area, waterfall, spline, funnel, bubble, polar, column, columnrange, pie, box plot, angular gauge, areasplinerange, and many other types of charts available separately and in combination, with single or multiple axes.\n\nAnyStock Financial and Stock JS Charts converts any real-time data into sophisticated charts that can easily be made interactive. Scrolling, drill downs, zoom, and panning make Reports and Dashboards greatly visualized to facilitate reviewing long-term and big data sets while analyzing Forex, commodity, investment and other market data.\n\nAnyMap JS Maps is perfect for dashboards and side-by-side reporting. This HTML5 mapping solution helps you build interactive maps for any browser on any platform. Use it to display sales by region, election results, population density and other geo-related data.\n\nAnyGantt JS Gantt Charts allows you to utilize power of animation and ultimate interactivity to build complex and informative HTML5 Gantt charts, which can be used with ASP.NET, ASP, PHP, JSP, ColdFusion, Ruby on Rails or simple HTML pages to visualize data from any warehouse: text, Excel, CSV - MySQL, MS SQL, Oracle DB servers.","logo":"http://img.stackshare.io/service/3319/DzHriaGc.png","name":"AnyChart JS","links":{"site":"http://www.anychart.com"},"tags":["chart","charting","charts","commercial","gantt","graph","html5","javascript","visualization"]}},{"title":"JS Charts","url":"/library/js-charts","id":"js-charts","library":{"id":"js-charts","description":"JS Charts is a JavaScript based chart generator that requires little or no coding. With JS Charts drawing charts is a simple and easy task, since you only have to use client-side scripting (i.e. performed by your web browser). No additional plugins or server modules are required. Just include our scripts, prepare your chart data in XML, JSON or JavaScript Array and your chart is ready!","logo":"http://cdn.problogdesign.com/wp-content/uploads/2010/03/jscharts.jpg","name":"JS Charts","links":{"site":"http://www.jscharts.com/"},"tags":["charts","commercial"]}},{"title":"Filepicker.io","url":"/library/filepicker-io","id":"filepicker-io","library":{"id":"filepicker-io","description":"Filepicker.io adds a full Filesystem API to javascript, even in older browsers, so you can do read and write operations. It also integrates for you with dropbox, google drive, facebook, the user's webcam, and 13 other cloud sources to pull in or save content","logo":"https://twimg0-a.akamaihd.net/profile_images/2702937220/902f46883b3bb9733ae99c8c99192211_reasonably_small.png","name":"Filepicker.io","links":{"site":"https://filepicker.io"},"tags":["commercial","dropbox","facebook","files","uploads"]}},{"title":"Isogenic Engine","url":"/library/isogenic-engine","id":"isogenic-engine","library":{"id":"isogenic-engine","description":"HTML5 Isometric & 2D Game Engine. Emphasis on real-time persistent worlds, MMO games & plugin architecture, micro-transactions, cloud-based hosting. Realtime networking. Support for canvas and HTML-based output, Node.js + MongoDB. Physics support using Box2D.","logo":"http://www.isogenicengine.com/wp-content/uploads/logo2.png","name":"Isogenic Engine","links":{"site":"http://www.isogenicengine.com/"},"tags":["2d","commercial","isometric"]}},{"title":"Unity","url":"/library/unity","id":"unity","library":{"id":"unity","description":"Unity is a feature rich, fully integrated development engine for the creation of interactive 3D content. It provides complete, out-of-the-box functionality to assemble high-quality, high-performing content and publish to multiple platforms. Unity helps indie developers and designers, small and major studios, multinational corporations, students and hobbyists to drastically reduce the time, effort and cost of making games.","logo":"/images/repo.png","name":"Unity","links":{"site":"https://unity3d.com/"},"tags":["commercial"]}},{"title":"Semtex UI","url":"/library/semtex-ui","id":"semtex-ui","library":{"id":"semtex-ui","description":"Modern UI framework with 18 (and growing) components for developing rich browser applications with JavaScript, HTML5 and CSS3.","logo":"/images/repo.png","name":"Semtex UI","links":{"site":"http://semtex.wemakesites.net/"},"tags":["ajax","commercial","forms","localstorage","popup","tabs","validation"]}},{"title":"awesomium","url":"/library/awesomium","id":"awesomium","library":{"id":"awesomium","description":"Web UI is just a fancy term for any interface built with HTML, JS, and CSS.\n\nOur library provides the special sauce that allows you to integrate Web UI content in any C++ or .NET application.","logo":"/images/repo.png","name":"awesomium","links":{"site":"http://awesomium.com/"},"tags":["commercial"]}},{"title":"Webix","url":"/library/webix","id":"webix","library":{"id":"webix","description":"Webix is a ross-browser, cross-device JavaScript UI framework for building interactive web apps using CSS and HTML5 techniques.\nThe library delivers over 40 fully customizable components, provides JQuery integration and can work with any server-side platform: PHP, .NET, Java, etc. \nFlexible layouts, unlimited extensibility, controllable look-and-feel, and intuitive API allow creating apps of any difficulty that will work equally well on desktop, mobile and tablet devices.","logo":"http://webix.com/wp-content/themes/webix/images/logo_header.png","name":"Webix","links":{"site":"http://webix.com/"},"tags":["commercial","css3","html5","javascript"]}},{"title":"AntiSoft HTML Protector","url":"/library/antisoft-html-protector","id":"antisoft-html-protector","library":{"id":"antisoft-html-protector","description":"HTML Protector is a tool that helps you protect the content of your web page by preventing others from viewing your source code. Additionally, it will stop spam robots from extracting email addresses from your pages as well as prevent people from using automated downloader's to download your entire web site to their hard drive. HTML Protector offers three JavaScript based encryption methods to choose from and a variety of other features like right click disable, printing disable, password protect your pages, insert copyright information and more!","logo":"http://www.antssoft.com/image/header.jpg","name":"AntiSoft HTML Protector","links":{"site":"http://www.antssoft.com/htmlprotector/index.htm"},"tags":["commercial"]}},{"title":"Construct 2","url":"/library/construct-2","id":"construct-2","library":{"id":"construct-2","description":"Construct 2 is a visual HTML5 game development tool for Windows. Aimed for both beginners and advanced users.","logo":"/images/repo.png","name":"Construct 2","links":{"site":"http://www.scirra.com/construct2"},"tags":["2d","commercial"]}},{"title":"Jasob","url":"/library/jasob","id":"jasob","library":{"id":"jasob","description":"Jasob JavaScript Obfuscator protects, compresses and optimizes JavaScript, CSS and HTML code for faster download and execution speeds. JavaScript is a scripting programming language used in millions of Web pages worldwide. Scripting languages are not compiled, so JavaScript source code has to be downloaded together with the Web page in order to be run by the Web browser. This has several drawbacks and the most important one is that JavaScript source code can be easily viewed by anyone. All it takes is to open the Web page in the Web browser and to choose option View Source. This means that anyone can steal your JavaScript code, modify it and reuse it for his own purposes.","logo":"http://www.jasob.com/images/TitleJasob_v4.gif","name":"Jasob","links":{"site":"http://www.jasob.com/"},"tags":["commercial"]}},{"title":"Thicket","url":"/library/thicket","id":"thicket","library":{"id":"thicket","description":"The JavaScript Obfuscator tool obfuscates JavaScript source code to make it difficult to understand or reverse engineer (example). This provides significant protection for source code intellectual property that must be shipped to a customer, as is common when shipping JavaScript-enabled web pages to browsers or when JavaScript is used as a scripting language to support other activities (XSLT, etc.). It can also provide effective compression of JavaScript files to reduce script download time","logo":"/images/repo.png","name":"Thicket","links":{"site":"http://www.semdesigns.com/Products/Obfuscators/ECMAScriptObfuscator.html"},"tags":["commercial"]}},{"title":"OLAPCharts","url":"/library/olapcharts","id":"olapcharts","library":{"id":"olapcharts","description":"OLAPCharts is a programming free JavaScript Chart engine.\n\nIt contains all basic charts and a growing number of advanced charts and is fully interactive and responsive.\n\nBut the main focus lies on multidimensional data processing and transformation to make building dashboards easy.","logo":"http://www.olapcharts.com/logo.gif","name":"OLAPCharts","links":{"site":"http://www.olapcharts.com"},"tags":["OLAP","charts","commercial","graph","html5","javascript","library"]}},{"title":"lightSlider","url":"/library/jquery-lightslider","id":"jquery-lightslider","library":{"id":"jquery-lightslider","description":"JQuery lightSlider is a lightweight responsive Content slider with carousel thumbnails navigation","logo":"/images/repo.png","name":"lightSlider","links":{"site":"https://sachinchoolur.github.io/lightslider/","github":"https://github.com/sachinchoolur/lightslider"},"tags":["carousel","commercial","css3","gallery","responsive","slider"]}},{"title":"Scripts Encryptor","url":"/library/scripts-encryptor","id":"scripts-encryptor","library":{"id":"scripts-encryptor","description":"Scripts Encryptor is a handy utility to scramble (or, obfuscate) many types of source code files, such as HTML/ASP, JavaScript/JScript, VBScript, C/C++/MFC code. Unlike many other obfuscators it does not employ JavaScript for encoding, which significantly increases the number of web clients that will be able to open scrambled documents without problems. Use this software to compress your resulting scripts, as well as to protect your intellectual property from unauthorized copying and reverse engineering.","logo":"http://www.dennisbabkin.com/php/images/screnc-virtual-box.png","name":"Scripts Encryptor","links":{"site":"http://www.dennisbabkin.com/screnc/"},"tags":["commercial"]}},{"title":"Javascript Obfuscator","url":"/library/javascript-obfuscator","id":"javascript-obfuscator","library":{"id":"javascript-obfuscator","description":"Javascript Obfuscator converts the Java Script source code into completely unreadable form, preventing your code from analysing and theft. It's a 100% safe Java Script minifier and the best JavaScript compressor in the web.","logo":"http://java-applets.org/images/javascript-obfuscator.jpg","name":"Javascript Obfuscator","links":{"site":"http://java-applets.org/"},"tags":["commercial"]}},{"title":"jQWidgets","url":"/library/jqwidgets","id":"jqwidgets","library":{"id":"jqwidgets","description":"jQWidgets is faster and easy-to-use JavaScript UI SDK\nbased on the popular jQuery library.","logo":"http://www.jqwidgets.com/wp-admin/images/logo_bw.png","name":"jQWidgets","links":{"site":"http://www.jqwidgets.com/jquery-ui-widgets-toolkit/"},"tags":["commercial"]}},{"title":"jsreports","url":"/library/jsreports","id":"jsreports","library":{"id":"jsreports","description":"A custom end-user report designer in JavaScript.  Can execute reports client-side or transform them to JasperReports format to run on the server.  The goal of jsreports is to be the quickest, easiest way to add custom reporting to your web application.","logo":"http://jsreports.com/images/jsreports-thumb-small.png","name":"jsreports","links":{"site":"http://jsreports.com"},"tags":["commercial","reports"]}},{"title":"Playcraft","url":"/library/playcraft","id":"playcraft","library":{"id":"playcraft","description":"Complete HTML5  game engine toolset with support for multiple platforms including Facebook, web, Android and iOS.","logo":"/images/repo.png","name":"Playcraft","links":{"site":"http://getplaycraft.com/"},"tags":["android","commercial","facebook","ios"]}},{"title":"Illuminations for Developers","url":"/library/illuminations-for-developers","id":"illuminations-for-developers","library":{"id":"illuminations-for-developers","description":"A browser extension that takes JavaScript frameworks and makes their internals visible, including views, models, class names, and more.","logo":"/images/repo.png","name":"Illuminations for Developers","links":{"site":"http://www.illuminations-for-developers.com/"},"tags":["backbone","commercial","dojo","ember","jquery-ui","sencha","uki","yui"]}},{"title":"MonkeyBars","url":"/library/monkeybars","id":"monkeybars","library":{"id":"monkeybars","description":"A task based library that provides a simple structure for handling singular, sequential and parallel units of code.\n\nThe overall architecture is based off of the composite and decorator patterns. These patterns lend themselves very well to a task based library, where tasks can contain other tasks all contributing to the overall flow of an operation.\n\nThis library also makes it possible to run tasks concurrrently with help of HTML5 WebWorkers and Blobs.\n\nThe library itself has no hard ties to the browser, and because of this it works both in client-side and server-side javascript projects.\n\nIndividual tasks are highly extendable and can be extended to form all sorts of interesting processes.","logo":"/images/repo.png","name":"MonkeyBars","links":{"site":"https://mcgaryes.github.com/monkeybars/","github":"https://github.com/mcgaryes/monkeybars"},"tags":["commercial","parallel","sequence","task"]}},{"title":"modeljs","url":"/library/modeljs","id":"modeljs","library":{"id":"modeljs","description":"A simple javaScript library for creating the Model aspect of a MVC application.","logo":"/images/repo.png","name":"modeljs","links":{"github":"https://github.com/dgeorges/modeljs"},"tags":["commercial","modeljs"]}},{"title":"Closure FX Builder","url":"/library/closure-fx-builder","id":"closure-fx-builder","library":{"id":"closure-fx-builder","description":"Closure FX Builder is a stand-alone and feature-rich application for Google Closure Tools that allows you to minify, obfuscate and debug JavaScript code.","logo":"http://digi-area.com/images/closurefx/logo.png","name":"Closure FX Builder","links":{"site":"http://digi-area.com/ClosureFX/"},"tags":["Build","Closure","commercial","compiler","compressor","google","javascript","tools"]}},{"title":"AnyMap JS","url":"/library/anymap-js","id":"anymap-js","library":{"id":"anymap-js","description":"AnyMap JavaScript mapping library helps you build interactive maps that look great in any browser on any platform.\n\nAnyMap is perfect for interactive dashboards and side-by-side reporting. You can use it to display sales by region, election results, population density or any other geo-related data.\n\nAnyMap JS maps are absolutely compatible with basic charts, stock charts and Gantt charts also offered by AnyChart http://www.anychart.com, and can be used as part of the dashboard as good as standalone map visualization solution.\n\nAnyMap comes with ready-to-use Maps Collection which you can use at no additional cost. Custom maps can be created from any SHP map.","logo":"https://drive.google.com/a/anychart.com/file/d/0B2Ym3TNPFjTpOFpoVWVGblNQWlU/view?usp=sharing","name":"AnyMap JS","links":{"site":"http://www.anychart.com/products/anymap"},"tags":["chart","charting","charts","commercial","gantt","graph","html5","javascript","visualization"]}},{"title":"Kendo UI","url":"/library/kendo-ui","id":"kendo-ui","library":{"id":"kendo-ui","description":"Kendo UI is a HTML5, jQuery-based framework for building modern HTML apps. Kendo UI combines the best of emerging HTML5, CSS3, and JavaScript technologies with robust, cross-browser techniques to deliver a framework that is both powerfully rich and broadly compatible with older browsers.\n\nKendo UI combines everything that a developer needs to build a rich JavaScript app, eliminating the traditional challenge of manually researching and combining all of the needed plug-ins, frameworks, and libraries needed to build apps. Kendo UI includes rich UI controls for desktop, mobile and data vizualization, a JavaScript DataSource, fast Templates, cross-device Drag and Drop API, Globalization, Validation and MVVM framework extensions, and more.","logo":"http://jaydata.org/Themes/Bootstrap/Styles/img/logo_kendoui_solo.png","name":"Kendo UI","links":{"site":"http://www.telerik.com/kendo-ui","github":"https://github.com/telerik/kendo-ui-core"},"tags":["commercial","css3","html5","jquery"]}},{"title":"mark.js","url":"/library/mark-js","id":"mark-js","library":{"id":"mark-js","description":"A text highlighter intended for every use case. Has built-in options for diacritics, separate word search, synonyms, iframes, filters, accuracy, element, class name and more. Can be used with pure JavaScript or as jQuery plugin.","logo":"/images/repo.png","name":"mark.js","links":{"site":"https://markjs.io/","github":"https://github.com/julmot/mark.js"},"tags":["commercial","es6","highlight","jquery","mark","text"]}},{"title":"BXG","url":"/library/bxg","id":"bxg","library":{"id":"bxg","description":"HTML5 Game Engine JavaScript based game engine for high performance Web game Covers various type of Web game such as shooting, arcade and SNG etc. Provides graphical game editor, game oriented Web Runtime and game portal framework as well Runs on jBLUX UI Framework   The Adobe Flash Player is required for video playback.Get the latest Flash...","logo":"/images/repo.png","name":"BXG","links":{"github":"https://github.com/bluega/bxg.jslibrary.release"},"tags":["2d","commercial","hexagonal","isometric","orthogonal"]}},{"title":"SublimeVideo","url":"/library/sublimevideo","id":"sublimevideo","library":{"id":"sublimevideo","description":"The Web's Most Reliable HTML5 Video Player","logo":"http://blog.medias.jilion.com/uploads/2011/11/sublimevideo_free_and_unlimited.png","name":"SublimeVideo","links":{"site":"http://sublimevideo.net/"},"tags":["commercial","free","html5"]}},{"title":"Turbulenz","url":"/library/turbulenz","id":"turbulenz","library":{"id":"turbulenz","description":"Turbulenz offers the ability to build, publish and monetise high-quality games that react like no others, with immersive 2D and 3D effects and real-time physics that open up a whole new world of unprecedented and extraordinary web content.","logo":"https://0.gravatar.com/avatar/c3a7876e11bac6d876826a9adf922118?d=https://a248.e.akamai.net/assets.github.com%2Fimages%2Fgravatars%2Fgravatar-org-420.png","name":"Turbulenz","links":{"site":"http://turbulenz.com","github":"https://github.com/turbulenz/turbulenz_engine"},"tags":["2d","3d","audio","canvas","collisions","commercial","html5","networking","physics","webaudio","webgl","websockets"]}},{"title":"Geom","url":"/library/geom","id":"geom","library":{"id":"geom","description":"Javascript / HTML5 Game and Content Engine with Pro Editor.","logo":"/images/repo.png","name":"Geom","links":{"site":"http://www.pelisali.net/geom/"},"tags":["2d","commercial"]}},{"title":"ChartJS","url":"/library/chartjs","id":"chartjs","library":{"id":"chartjs","description":"Whether you are creating traditional websites, sites that target mobile devices, or native apps built with HTML5 JavaScript and compiled with Apache Cordova (PhoneGap), ChartJS provides high-performance and elegant data visualization options for all your business intelligence needs.","logo":"/images/repo.png","name":"ChartJS","links":{"site":"http://chartjs.devexpress.com/"},"tags":["commercial"]}},{"title":"Packery","url":"/library/packery","id":"packery","library":{"id":"packery","description":"Packery is a JavaScript layout library that uses a bin-packing algorithm. This is a fancy way of saying “it fills empty gaps.” Packery layouts can be intelligently ordered or organically wild. Elements can be stamped in place, fit in an ideal spot, or dragged around.","logo":"https://0.gravatar.com/avatar/8bb81621e78f36a6df9a6e6facf3ccc3?d=https://a248.e.akamai.net/assets.github.com%2Fimages%2Fgravatars%2Fgravatar-org-420.png","name":"Packery","links":{"site":"http://packery.metafizzy.co","github":"https://github.com/metafizzy/packery"},"tags":["commercial"]}},{"title":"jquery-comments","url":"/library/jquery-comments","id":"jquery-comments","library":{"id":"jquery-comments","description":"jquery-comments is a jQuery plugin for implementing an out-of-the-box commenting solution to any web application with an existing backend. It provides all the UI functionalities and ties them to callbacks that let you easily define what you want to do with the data. The library is highly customizable and very easy to integrate thanks to a wide variety of settings.","logo":"https://www.viima.com/wp-content/uploads/2014/05/viima_logo_black_small.png","name":"jquery-comments","links":{"site":"https://www.viima.com/introducing-jquery-comments/","github":"https://github.com/Viima/jquery-comments"},"tags":["chat","comment","comments","commercial","jquery"]}},{"title":"Impact","url":"/library/impact","id":"impact","library":{"id":"impact","description":"Javascript / HTML5 Game Engine with world editor.","logo":"http://impactjs.com/templates/impact/impact.png","name":"Impact","links":{"site":"http://impactjs.com/"},"tags":["2d","commercial"]}},{"title":"Stunnix JavaScript Obfuscator","url":"/library/stunnix-javascript-obfuscator","id":"stunnix-javascript-obfuscator","library":{"id":"stunnix-javascript-obfuscator","description":"Stunnix JavaScript Obfuscator is a unique solution for this piracy and misuse problem for code written in ECMAScript or JavaScript programming languages. It's both an obfuscation and encoding tool for JavaScript source code in .js files and in HTML, PHP, ASP and JSP pages, with advanced support for adding difficult to remove automatic licensing checks.","logo":"http://www.stunnix.com/images/h_logo.png","name":"Stunnix JavaScript Obfuscator","links":{"site":"http://www.stunnix.com/prod/jo/"},"tags":["commercial"]}},{"title":"jQuery Tour","url":"/library/jquery-tour","id":"jquery-tour","library":{"id":"jquery-tour","description":"jQuery based Tour plugin with custom styles and powerful API.","logo":"/images/repo.png","name":"jQuery Tour","links":{"site":"http://codecanyon.net/item/jquery-tour-the-flexible-tour-plugin/1052564"},"tags":["commercial","guide","tour"]}},{"title":"Ignite UI","url":"/library/ignite-ui","id":"ignite-ui","library":{"id":"ignite-ui","description":"With Ignite UI, developers can create next generation, browser-based, touch-enabled tablet, mobile & desktop experiences.  At its core, Ignite UI is a set of full-featured, high-performance HTML & JavaScript user interface controls based on jQuery Core, jQuery UI and jQuery Mobile JavaScript libraries. Ignite UI also includes MVC & ASP.NET server-side wrappers. On top of that, Ignite UI features a set of Mobile controls with adaptive CSS, which you can use for your iPhone, Android & Windows Phone applications.","logo":"http://users.infragistics.com/ignite/ignite-white.png","name":"Ignite UI","links":{"site":"http://www.infragistics.com/products/jquery/"},"tags":["commercial","css3","html5","jquery"]}},{"title":"PubNub","url":"/library/pubnub","id":"pubnub","library":{"id":"pubnub","description":"Build low-latency applications that scale to millions of users. Add presence based push notifications via PubNub's real-time messaging service.","logo":"https://pubnub.s3.amazonaws.com/2012/pubnub-large.png","name":"PubNub","links":{"site":"http://www.pubnub.com","github":"https://github.com/pubnub/pubnub-api"},"tags":["commercial"]}},{"title":"Listy-Text","url":"/library/listy-text","id":"listy-text","library":{"id":"listy-text","description":"A jQuery plugin to make gathering lists of data with text inputs more user friendly and intuitive.","logo":"/images/repo.png","name":"Listy-Text","links":{"site":"https://mwmnj.github.com/listy-text/","github":"https://github.com/mwmnj/listy-text"},"tags":["commercial","jquery"]}},{"title":"GoJS","url":"/library/gojs","id":"gojs","library":{"id":"gojs","description":"GoJS is a library that allows JavaScript programmers to easily create customized canvas-based interactive diagrams. Customizable nodes, links, and layouts are some of its key features.","logo":"https://i.imgur.com/WHyFtPT.png","name":"GoJS","links":{"site":"http://gojs.net"},"tags":["chart","commercial","diagram"]}},{"title":"JS Cruncher Pro","url":"/library/js-cruncher-pro","id":"js-cruncher-pro","library":{"id":"js-cruncher-pro","description":"JSCruncher Pro reduces file sizes an average of 60% in the blink of an eye! Have a look at our features and reasonable pricing. We're confident you'll find JSCruncher Pro to be best tool in its class.","logo":"http://www.nebiru.com/jscruncherpro.png","name":"JS Cruncher Pro","links":{"site":"http://domapi.com/jscruncherpro/"},"tags":["commercial"]}},{"title":"Ribbon UI","url":"/library/ribbon-ui","id":"ribbon-ui","library":{"id":"ribbon-ui","description":"Arguably the best recreation of the desktop ribbon bar with JavaScript, CSS3 and HTML5.","logo":"/images/repo.png","name":"Ribbon UI","links":{"site":"http://wemakesites.net/#!/details?component=ribbon-bar-xml"},"tags":["bar","commercial","javascript","ribbonbar","ui"]}}]