[{"title":"UglifyJS","url":"/library/uglifyjs","id":"uglifyjs","library":{"id":"uglifyjs","description":"This package implements a general-purpose JavaScript parser/compressor/beautifier toolkit. It is developed on NodeJS, but it should work on any JavaScript platform supporting the CommonJS module system (and if your platform of choice doesn’t support CommonJS, you can easily implement it, or discard the exports.* lines from UglifyJS sources).","logo":"/images/repo.png","name":"UglifyJS","links":{"site":"http://marijn.haverbeke.nl/uglifyjs","github":"https://github.com/mishoo/UglifyJS"},"tags":["npm"]}},{"title":"Recess","url":"/library/recess","id":"recess","library":{"id":"recess","description":"Developed at Twitter to support our internal styleguide, RECESS is a simple, attractive code quality tool for CSS built on top of LESS.\n\nIncorporate it into your development process as a linter, or integrate it directly into your build system as a compiler, RECESS will keep your source looking clean and super manageable.","logo":"https://0.gravatar.com/avatar/2f4a8254d032a8ec5e4c48d461e54fcc?d=https://a248.e.akamai.net/assets.github.com%2Fimages%2Fgravatars%2Fgravatar-org-420.png","name":"Recess","links":{"site":"https://twitter.github.com/recess","github":"https://github.com/twitter/recess"},"tags":["Build","nodejs","npm"]}},{"title":"Krasota.js","url":"/library/krasota-js","id":"krasota-js","library":{"id":"krasota-js","description":"Krasota.js is trying to save the world. It provides the ability to carry out the syntactic transformation JavaScript code. Conversions can be both for the protection coding style, and for more complex refactorings logic.","logo":"/images/repo.png","name":"Krasota.js","links":{"site":"https://veged.github.com/krasota.js/","github":"https://github.com/veged/krasota.js/"},"tags":["JS","beautifier","parsers"]}},{"title":"JScrambler","url":"/library/jscrambler","id":"jscrambler","library":{"id":"jscrambler","description":"If you develop a security sensitive Web Application we believe that you don't want to give any bonuses to possible attackers. JScrambler enables you to conceal as much as possible, the logic of your application, such as what information is gathered from the user, how it is processed on the client-side, how it is sent to the servers-side. Since our obfuscation introduces a certain level of randomness, it allows you to explore code morphing techniques, which can be vital in precluding attack automation.","logo":"http://s28.postimg.org/3uhgplclp/jscrambler_logo_01.png","name":"JScrambler","links":{"site":"https://jscrambler.com"},"tags":[]}},{"title":"YUI Compressor","url":"/library/yui-compressor","id":"yui-compressor","library":{"id":"yui-compressor","description":"YUI Compressor is an open source tool that supports the compression of both JavaScript and CSS files. The JavaScript compression removes comments and white-spaces as well as obfuscates local variables using the smallest possible variable name. CSS compression is done using a regular-expression-based CSS minifier.","logo":"https://yuilibrary.com/img/yui-logo.png","name":"YUI Compressor","links":{"site":"https://yuilibrary.com/projects/yuicompressor/"},"tags":[]}},{"title":"Closure Compiler","url":"/library/closure-compiler","id":"closure-compiler","library":{"id":"closure-compiler","description":"The Closure Compiler is a tool for making JavaScript download and run faster. It is a true compiler for JavaScript. Instead of compiling from a source language to machine code, it compiles from JavaScript to better JavaScript. It parses your JavaScript, analyzes it, removes dead code and rewrites and minimizes what's left. It also checks syntax, variable references, and types, and warns about common JavaScript pitfalls.","logo":"http://www.weareinstrument.com/image_cache/assets/0000/1807/02-developers_temp.jpg?w=930","name":"Closure Compiler","links":{"site":"https://developers.google.com/closure/compiler/?hl=uk"},"tags":["google"]}},{"title":"Strong JS","url":"/library/strong-js","id":"strong-js","library":{"id":"strong-js","description":"It is a shrinker/obfuscator for JavaScripts. You can use it to easily and quickly reduce the size of typical JavaScript files by 50% on average depending on the style the code is written in. Strong JS allows you to delete all unnecessary bytes in scripts, such as comments, new line characters and unnecessary spaces. The execution of the js file won't change after it is compressed. It just executes like before. You won't see a difference, only the file size will be smaller. Also, it can rename variables giving them short names.","logo":"http://www.stronghtml.com/images/logo.gif","name":"Strong JS","links":{"site":"http://www.stronghtml.com/tools/js/"},"tags":[]}},{"title":"JS Cruncher Pro","url":"/library/js-cruncher-pro","id":"js-cruncher-pro","library":{"id":"js-cruncher-pro","description":"JSCruncher Pro reduces file sizes an average of 60% in the blink of an eye! Have a look at our features and reasonable pricing. We're confident you'll find JSCruncher Pro to be best tool in its class.","logo":"http://www.nebiru.com/jscruncherpro.png","name":"JS Cruncher Pro","links":{"site":"http://domapi.com/jscruncherpro/"},"tags":["commercial"]}},{"title":"Javascript Obfuscator","url":"/library/javascript-obfuscator","id":"javascript-obfuscator","library":{"id":"javascript-obfuscator","description":"Javascript Obfuscator converts the Java Script source code into completely unreadable form, preventing your code from analysing and theft. It's a 100% safe Java Script minifier and the best JavaScript compressor in the web.","logo":"http://java-applets.org/images/javascript-obfuscator.jpg","name":"Javascript Obfuscator","links":{"site":"http://java-applets.org/"},"tags":["commercial"]}},{"title":"AntiSoft HTML Protector","url":"/library/antisoft-html-protector","id":"antisoft-html-protector","library":{"id":"antisoft-html-protector","description":"HTML Protector is a tool that helps you protect the content of your web page by preventing others from viewing your source code. Additionally, it will stop spam robots from extracting email addresses from your pages as well as prevent people from using automated downloader's to download your entire web site to their hard drive. HTML Protector offers three JavaScript based encryption methods to choose from and a variety of other features like right click disable, printing disable, password protect your pages, insert copyright information and more!","logo":"http://www.antssoft.com/image/header.jpg","name":"AntiSoft HTML Protector","links":{"site":"http://www.antssoft.com/htmlprotector/index.htm"},"tags":["commercial"]}},{"title":"JSMin","url":"/library/jsmin","id":"jsmin","library":{"id":"jsmin","description":"JSMin is a filter which removes comments and unnecessary whitespace from JavaScript files. It typically reduces filesize by half, resulting in faster downloads. It also encourages a more expressive programming style because it eliminates the download cost of clean, literate self-documentation.","logo":"/images/repo.png","name":"JSMin","links":{"site":"http://www.crockford.com/javascript/jsmin.html"},"tags":[]}},{"title":"ObfuscateJS","url":"/library/obfuscatejs","id":"obfuscatejs","library":{"id":"obfuscatejs","description":"The obfuscator currently removes whitespace and comments. It renames variablenames with a local scope to a shorter version, And as an advanced option it renames all variables with a certain prefix to a shorter name. In the near future the tool will be extended with even more options to shorten variable names.","logo":"/images/repo.png","name":"ObfuscateJS","links":{"site":"http://tools.2vi.nl/"},"tags":["java"]}},{"title":"Digua","url":"/library/digua","id":"digua","library":{"id":"digua","description":"Patu Digua, or shortly Digua, is a web (HTML, JavaScript and CSS) obfuscator and compressor. It will reduce the size of your website, boosting performance this way, and it will make your JavaScript source code harder to be copied.","logo":"http://digua.sourceforge.net/images/logo.jpg","name":"Digua","links":{"site":"http://digua.sourceforge.net/"},"tags":["java"]}},{"title":"Stunnix JavaScript Obfuscator","url":"/library/stunnix-javascript-obfuscator","id":"stunnix-javascript-obfuscator","library":{"id":"stunnix-javascript-obfuscator","description":"Stunnix JavaScript Obfuscator is a unique solution for this piracy and misuse problem for code written in ECMAScript or JavaScript programming languages. It's both an obfuscation and encoding tool for JavaScript source code in .js files and in HTML, PHP, ASP and JSP pages, with advanced support for adding difficult to remove automatic licensing checks.","logo":"http://www.stunnix.com/images/h_logo.png","name":"Stunnix JavaScript Obfuscator","links":{"site":"http://www.stunnix.com/prod/jo/"},"tags":["commercial"]}},{"title":"Thicket","url":"/library/thicket","id":"thicket","library":{"id":"thicket","description":"The JavaScript Obfuscator tool obfuscates JavaScript source code to make it difficult to understand or reverse engineer (example). This provides significant protection for source code intellectual property that must be shipped to a customer, as is common when shipping JavaScript-enabled web pages to browsers or when JavaScript is used as a scripting language to support other activities (XSLT, etc.). It can also provide effective compression of JavaScript files to reduce script download time","logo":"/images/repo.png","name":"Thicket","links":{"site":"http://www.semdesigns.com/Products/Obfuscators/ECMAScriptObfuscator.html"},"tags":["commercial"]}},{"title":"JavaScript Obfuscator for Node.js","url":"/library/javascript-obfuscator-for-node-js","id":"javascript-obfuscator-for-node-js","library":{"id":"javascript-obfuscator-for-node-js","description":"JavaScript Obfuscator for Node.js is an open-source node library that protects your JS code from being stolen or used without permission.\n\nYou can install it with \"npm install javascript-obfuscator --save\"\n\nIt has features like debug protection, self-defending and domain lock.\n\nYou can also use an online demo here: https://javascriptobfuscator.herokuapp.com/\n\nIf you're using webpack, it also features a companion webpack plugin.","logo":"/images/repo.png","name":"JavaScript Obfuscator for Node.js","links":{"site":"https://javascriptobfuscator.herokuapp.com/","github":"https://github.com/javascript-obfuscator/javascript-obfuscator"},"tags":["obfuscator"]}},{"title":"Jasob","url":"/library/jasob","id":"jasob","library":{"id":"jasob","description":"Jasob JavaScript Obfuscator protects, compresses and optimizes JavaScript, CSS and HTML code for faster download and execution speeds. JavaScript is a scripting programming language used in millions of Web pages worldwide. Scripting languages are not compiled, so JavaScript source code has to be downloaded together with the Web page in order to be run by the Web browser. This has several drawbacks and the most important one is that JavaScript source code can be easily viewed by anyone. All it takes is to open the Web page in the Web browser and to choose option View Source. This means that anyone can steal your JavaScript code, modify it and reuse it for his own purposes.","logo":"http://www.jasob.com/images/TitleJasob_v4.gif","name":"Jasob","links":{"site":"http://www.jasob.com/"},"tags":["commercial"]}},{"title":"Scripts Encryptor","url":"/library/scripts-encryptor","id":"scripts-encryptor","library":{"id":"scripts-encryptor","description":"Scripts Encryptor is a handy utility to scramble (or, obfuscate) many types of source code files, such as HTML/ASP, JavaScript/JScript, VBScript, C/C++/MFC code. Unlike many other obfuscators it does not employ JavaScript for encoding, which significantly increases the number of web clients that will be able to open scrambled documents without problems. Use this software to compress your resulting scripts, as well as to protect your intellectual property from unauthorized copying and reverse engineering.","logo":"http://www.dennisbabkin.com/php/images/screnc-virtual-box.png","name":"Scripts Encryptor","links":{"site":"http://www.dennisbabkin.com/screnc/"},"tags":["commercial"]}}]